{
    "questionId": "113",
    "questionFrontendId": "113",
    "title": "Path Sum II",
    "titleSlug": "path-sum-ii",
    "content": "<p>Given the <code>root</code> of a binary tree and an integer <code>targetSum</code>, return <em>all <strong>root-to-leaf</strong> paths where the sum of the node values in the path equals </em><code>targetSum</code><em>. Each path should be returned as a list of the node <strong>values</strong>, not node references</em>.</p>\n\n<p>A <strong>root-to-leaf</strong> path is a path starting from the root and ending at any leaf node. A <strong>leaf</strong> is a node with no children.</p>\n\n<p>&nbsp;</p>\n<p><strong class=\"example\">Example 1:</strong></p>\n<img alt=\"\" src=\"images/113/pathsumii1.jpg\" style=\"width: 500px; height: 356px;\" />\n<pre>\n<strong>Input:</strong> root = [5,4,8,11,null,13,4,7,2,null,null,5,1], targetSum = 22\n<strong>Output:</strong> [[5,4,11,2],[5,8,4,5]]\n<strong>Explanation:</strong> There are two paths whose sum equals targetSum:\n5 + 4 + 11 + 2 = 22\n5 + 8 + 4 + 5 = 22\n</pre>\n\n<p><strong class=\"example\">Example 2:</strong></p>\n<img alt=\"\" src=\"images/113/pathsum2.jpg\" style=\"width: 212px; height: 181px;\" />\n<pre>\n<strong>Input:</strong> root = [1,2,3], targetSum = 5\n<strong>Output:</strong> []\n</pre>\n\n<p><strong class=\"example\">Example 3:</strong></p>\n\n<pre>\n<strong>Input:</strong> root = [1,2], targetSum = 0\n<strong>Output:</strong> []\n</pre>\n\n<p>&nbsp;</p>\n<p><strong>Constraints:</strong></p>\n\n<ul>\n\t<li>The number of nodes in the tree is in the range <code>[0, 5000]</code>.</li>\n\t<li><code>-1000 &lt;= Node.val &lt;= 1000</code></li>\n\t<li><code>-1000 &lt;= targetSum &lt;= 1000</code></li>\n</ul>\n",
    "difficulty": "Medium",
    "stats": "{\"totalAccepted\": \"1.1M\", \"totalSubmission\": \"1.8M\", \"totalAcceptedRaw\": 1137706, \"totalSubmissionRaw\": 1843589, \"acRate\": \"61.7%\"}",
    "hints": [],
    "similarQuestions": "[{\"title\": \"Path Sum\", \"titleSlug\": \"path-sum\", \"difficulty\": \"Easy\", \"translatedTitle\": null}, {\"title\": \"Binary Tree Paths\", \"titleSlug\": \"binary-tree-paths\", \"difficulty\": \"Easy\", \"translatedTitle\": null}, {\"title\": \"Path Sum III\", \"titleSlug\": \"path-sum-iii\", \"difficulty\": \"Medium\", \"translatedTitle\": null}, {\"title\": \"Path Sum IV\", \"titleSlug\": \"path-sum-iv\", \"difficulty\": \"Medium\", \"translatedTitle\": null}, {\"title\": \"Step-By-Step Directions From a Binary Tree Node to Another\", \"titleSlug\": \"step-by-step-directions-from-a-binary-tree-node-to-another\", \"difficulty\": \"Medium\", \"translatedTitle\": null}]",
    "topicTags": [
        {
            "name": "Backtracking",
            "slug": "backtracking"
        },
        {
            "name": "Tree",
            "slug": "tree"
        },
        {
            "name": "Depth-First Search",
            "slug": "depth-first-search"
        },
        {
            "name": "Binary Tree",
            "slug": "binary-tree"
        }
    ],
    "companyTags": null,
    "codeSnippets": [
        {
            "lang": "Java",
            "langSlug": "java",
            "code": "/**\n * Definition for a binary tree node.\n * public class TreeNode {\n *     int val;\n *     TreeNode left;\n *     TreeNode right;\n *     TreeNode() {}\n *     TreeNode(int val) { this.val = val; }\n *     TreeNode(int val, TreeNode left, TreeNode right) {\n *         this.val = val;\n *         this.left = left;\n *         this.right = right;\n *     }\n * }\n */\nclass Solution {\n    public List<List<Integer>> pathSum(TreeNode root, int targetSum) {\n        \n    }\n}"
        }
    ],
    "solution": {
        "content": "<h2><a href=\"#solution\"><svg><path></path></svg></a>Solution</h2>\n<h3><a href=\"#approach-depth-first-traversal--recursion\"><svg><path></path></svg></a>Approach: Depth First Traversal | Recursion</h3>\n<p><strong>Intuition</strong></p>\n<p>The intuition for this approach is pretty straightforward. The problem statement asks us to find <em>all</em> root to leaf paths in a given binary tree. If you simply consider the depth first traversal on a tree, all it does is traverse once branch after another. All we need to do here is to simply execute the depth first traversal and maintain two things along the way:</p>\n<ol>\n<li>A running sum of all the nodes traversed till that point in recursion and</li>\n<li>A list of all those nodes</li>\n</ol>\n<p>If ever the sum becomes equal to the required sum, and the node where this happens is a leaf node, we can simply add the list of nodes to our final solution. We keep on doing this for every branch of the tree and we will get all the root to leaf paths in this manner that add up to a certain value. Basically, these paths are branches and hence the depth first traversal makes the most sense here. We can also use the breadth first approach for solving this problem. However, that would be super heavy on memory and is not a recommended approach for this very problem. We will look into more details towards the end.</p>\n<p><strong>Algorithm</strong></p>\n<ol>\n<li>\n<p>We'll define a function called <code>recurseTree</code> which will take the following parameters</p>\n<ul>\n<li><code>node</code> which represents the current node we are on during recursion</li>\n<li><code>remainingSum</code> which represents the remaining sum that we need to find going down the tree. We can also pass the current sum in our recursive calls. However, then we'd also need to pass the required sum as an additional variable since we'd have to compare the current sum against that value. By passing in remaining sum, we can avoid having to pass additional variable and just see if the remaining sum is 0 (or equal to the value of the current node).</li>\n<li>Finally, we'll have to pass a list of nodes here which will simply contain the list of all the nodes we have seen till now on the current branch. Let's call this <code>pathNodes</code>.</li>\n<li>The following examples assume the sum to be found is 22.</li>\n</ul>\n</li>\n<li>\n<p>At every step along the way, we will simply check if the remaining sum is equal to the value of the current node. If that is the case and the current node is a leaf node, we will add the current <code>pathNodes</code> to the final list of paths that we have to return as a result.</p>\n</li>\n<li>\n<p>The problem statement here specifically mentions <code>root to leaf</code> paths. A slight <em>modification</em> is to find all <code>root to node paths</code>. The solutions are almost similar except that we'd get rid of the <em>leaf check</em>.</p>\n<ul>\n<li>An important thing to consider for this modification is that the problem statement doesn't mention anything about the values of the nodes. That means, we can't assume them to be positive. Had the values been positive, we could stop at the node where the sum became equal to the node's value.</li>\n<li>However, if the values of the nodes can be negative, then we have to traverse all the branches, all the way up to the roots. Let's look at a modified tree for reference.</li>\n</ul>\n</li>\n<li>\n<p>We process one node at a time and every time the value of the remaining sum becomes equal to the value of the current node, we add the <code>pathNodes</code> to our final list. Let's go ahead and look at the implementation for this algorithm.</p>\n</li>\n</ol>\n<pre><code>class Solution {\n\n    // The function definition\n    private void recurseTree(TreeNode node, int remainingSum,\n                             List&lt;Integer&gt; pathNodes,\n                             List&lt;List&lt;Integer&gt;&gt; pathsList) {\n        if (node == null) {\n            return;\n        }\n\n        // Add the current node to the path's list\n        pathNodes.add(node.val);\n\n        // Check if the current node is a leaf and also, if it\n        // equals our remaining sum. If it does, we add the path to\n        // our list of paths\n        if (remainingSum == node.val && node.left == null && node.right == null) {\n            pathsList.add(new ArrayList&lt;&gt;(pathNodes));\n        } else {\n            // Else, we will recurse on the left and the right children\n            recurseTree(node.left, remainingSum - node.val, pathNodes, pathsList);\n            recurseTree(node.right, remainingSum - node.val, pathNodes, pathsList);\n        }\n\n        // We need to remove the node once we are done processing ALL of its\n        // subtrees.\n        pathNodes.remove(pathNodes.size() - 1);\n    }\n\n    public List&lt;List&lt;Integer&gt;&gt; pathSum(TreeNode root, int sum) {\n        List&lt;List&lt;Integer&gt;&gt; pathsList = new ArrayList&lt;&gt;();\n        List&lt;Integer&gt; pathNodes = new ArrayList&lt;&gt;();\n        recurseTree(root, sum, pathNodes, pathsList);\n        return pathsList;\n    }\n}</code></pre>\n<p><strong>Complexity Analysis</strong></p>\n<ul>\n<li>\n<p>Time Complexity: O(N2) where N are the number of nodes in a tree. In the worst case, we could have a complete binary tree and if that is the case, then there would be N/2 leafs. For every leaf, we perform a potential O(N) operation of copying over the <code>pathNodes</code> nodes to a new list to be added to the final <code>pathsList</code>. Hence, the complexity in the worst case could be O(N2).</p>\n</li>\n<li>\n<p>Space Complexity: O(N). The space complexity, like many other problems is debatable here. I personally choose <em>not</em> to consider the space occupied by the <code>output</code> in the space complexity. So, all the <code>new</code> lists that we create for the paths are actually a part of the output and hence, don't count towards the final space complexity. The only <em>additional</em> space that we use is the <code>pathNodes</code> list to keep track of nodes along a branch.</p>\n<p>We could include the space occupied by the new lists (and hence the output) in the space complexity and in that case the space would be O(N2). There's a great answer on <a href=\"https://cs.stackexchange.com/questions/83574/does-space-complexity-analysis-usually-include-output-space\">Stack Overflow</a> about whether to consider input and output space in the space complexity or not. I prefer <em>not</em> to include them.</p>\n</li>\n</ul>\n<p><strong>Why Breadth First Search is bad for this problem?</strong></p>\n<p>We did touch briefly on this in the intuition section. BFS would solve this problem perfectly. However, note that the problem statement actually asks us to return a list of all the paths that add up to a particular sum. Breadth first search moves one level at a time. That means, we would have to maintain the <code>pathNodes</code> lists for <code>all</code> the paths till a particular level/depth at the same time.</p>\n<p>Say we are at the level 10 in the tree and that level has e.g. 20 nodes. BFS uses a queue for processing the nodes. Along with 20 nodes in the queue, we would also need to maintain 20 different <code>pathNodes</code> lists since there is no backtracking here. That is too much of a space overhead.</p>\n<p>The good thing about depth first search is that it uses recursion for processing one branch at a time and once we are done processing the nodes of a particular branch, we <code>pop</code> them from the <code>pathNodes</code> list thus saving on space. At a time, this list would only contain all the nodes in a single branch of the tree and nothing more. Had the problem statement asked us the total number of paths that add up to a particular sum (root to leaf), then breadth first search would be an equally viable approach.</p>",
        "isOfficial": true,
        "scrapedAt": "2026-02-18T07:26:13.116Z"
    }
}