{
    "questionId": "123",
    "questionFrontendId": "123",
    "title": "Best Time to Buy and Sell Stock III",
    "titleSlug": "best-time-to-buy-and-sell-stock-iii",
    "content": "<p>You are given an array <code>prices</code> where <code>prices[i]</code> is the price of a given stock on the <code>i<sup>th</sup></code> day.</p>\n\n<p>Find the maximum profit you can achieve. You may complete <strong>at most two transactions</strong>.</p>\n\n<p><strong>Note:</strong> You may not engage in multiple transactions simultaneously (i.e., you must sell the stock before you buy again).</p>\n\n<p>&nbsp;</p>\n<p><strong class=\"example\">Example 1:</strong></p>\n\n<pre>\n<strong>Input:</strong> prices = [3,3,5,0,0,3,1,4]\n<strong>Output:</strong> 6\n<strong>Explanation:</strong> Buy on day 4 (price = 0) and sell on day 6 (price = 3), profit = 3-0 = 3.\nThen buy on day 7 (price = 1) and sell on day 8 (price = 4), profit = 4-1 = 3.</pre>\n\n<p><strong class=\"example\">Example 2:</strong></p>\n\n<pre>\n<strong>Input:</strong> prices = [1,2,3,4,5]\n<strong>Output:</strong> 4\n<strong>Explanation:</strong> Buy on day 1 (price = 1) and sell on day 5 (price = 5), profit = 5-1 = 4.\nNote that you cannot buy on day 1, buy on day 2 and sell them later, as you are engaging multiple transactions at the same time. You must sell before buying again.\n</pre>\n\n<p><strong class=\"example\">Example 3:</strong></p>\n\n<pre>\n<strong>Input:</strong> prices = [7,6,4,3,1]\n<strong>Output:</strong> 0\n<strong>Explanation:</strong> In this case, no transaction is done, i.e. max profit = 0.\n</pre>\n\n<p>&nbsp;</p>\n<p><strong>Constraints:</strong></p>\n\n<ul>\n\t<li><code>1 &lt;= prices.length &lt;= 10<sup>5</sup></code></li>\n\t<li><code>0 &lt;= prices[i] &lt;= 10<sup>5</sup></code></li>\n</ul>\n",
    "difficulty": "Hard",
    "stats": "{\"totalAccepted\": \"923.1K\", \"totalSubmission\": \"1.7M\", \"totalAcceptedRaw\": 923147, \"totalSubmissionRaw\": 1738525, \"acRate\": \"53.1%\"}",
    "hints": [],
    "similarQuestions": "[{\"title\": \"Best Time to Buy and Sell Stock\", \"titleSlug\": \"best-time-to-buy-and-sell-stock\", \"difficulty\": \"Easy\", \"translatedTitle\": null}, {\"title\": \"Best Time to Buy and Sell Stock II\", \"titleSlug\": \"best-time-to-buy-and-sell-stock-ii\", \"difficulty\": \"Medium\", \"translatedTitle\": null}, {\"title\": \"Best Time to Buy and Sell Stock IV\", \"titleSlug\": \"best-time-to-buy-and-sell-stock-iv\", \"difficulty\": \"Hard\", \"translatedTitle\": null}, {\"title\": \"Maximum Sum of 3 Non-Overlapping Subarrays\", \"titleSlug\": \"maximum-sum-of-3-non-overlapping-subarrays\", \"difficulty\": \"Hard\", \"translatedTitle\": null}, {\"title\": \"Maximum Profit From Trading Stocks\", \"titleSlug\": \"maximum-profit-from-trading-stocks\", \"difficulty\": \"Medium\", \"translatedTitle\": null}, {\"title\": \"Maximize Win From Two Segments\", \"titleSlug\": \"maximize-win-from-two-segments\", \"difficulty\": \"Medium\", \"translatedTitle\": null}]",
    "topicTags": [
        {
            "name": "Array",
            "slug": "array"
        },
        {
            "name": "Dynamic Programming",
            "slug": "dynamic-programming"
        }
    ],
    "companyTags": null,
    "codeSnippets": [
        {
            "lang": "Java",
            "langSlug": "java",
            "code": "class Solution {\n    public int maxProfit(int[] prices) {\n        \n    }\n}"
        }
    ],
    "solution": {
        "content": "<h2><a href=\"#solution\"><svg><path></path></svg></a>Solution</h2>\n<hr/>\n<h3><a href=\"#overview\"><svg><path></path></svg></a>Overview</h3>\n<p>First of all, as one should know, this is one of the problems from the series of <a href=\"https://leetcode.com/problems/best-time-to-buy-and-sell-stock/\">Best Time to Buy and Sell Stock</a> problem. One could start from the first problem in the series and progress one by one from easy to hard.</p>\n<p>If there is ever a God of the stock market, who knows the price of stock at any moment, then the strategies to gain the maximum profits from the stock market is actually surprisingly intuitive, which also depends on the number of transactions that one can make.</p>\n<blockquote>\n<p>If one can only make one transaction (<em>i.e.</em> buy and sell once), then better to make this one <em>bet</em> count. The best strategy would be to <em>buy</em> at the <strong><em>lowest</em></strong> price and then <em>sell</em> at the <strong><em>highest</em></strong> price. To put it simple, <em>buy low sell high.</em></p>\n</blockquote>\n<p></p>\n<p>Let us look at a concrete example as shown in the above graph, given a list of prices, the task becomes to find maximal <em>difference</em> between a <strong><em>latter</em></strong> stock price and an <strong><em>earlier</em></strong> one, which would be the maximal profits that we could gain, if only one transaction is allowed.</p>\n<p>In the above example, the best moment to buy the stock would be the timestamp <code>t1</code>, and the best moment to sell the stock would be the timestamp <code>t9</code>.</p>\n<p>The above strategy is actually the solution to the first problem of the series, <em>i.e.</em> <a href=\"https://leetcode.com/problems/best-time-to-buy-and-sell-stock/\">Best Time to Buy and Sell Stock</a>.</p>\n<blockquote>\n<p>On the other hand, if one can make as many transactions as one would like, then in order to gain the maximal profits, one must <em>capture</em> each <strong>augmentation</strong> and <em>avoid</em> each <strong>plunging</strong> of stock price.</p>\n</blockquote>\n<p>Specifically, given a list of prices, for any two adjacent time points with stock prices <code>p1</code> and <code>p2</code>, the above best strategies can be broke down into the following two cases:</p>\n<ul>\n<li>\n<p>If later the price augments, <em>i.e.</em> <code>p2 &gt; p1</code>, then a good trader should buy at <code>p1</code> and then sell at <code>p2</code>, seizing this moment to make profits.</p>\n<br/>\n</li>\n<li>\n<p>If later the price stays the same or even plunges, <em>i.e.</em> <code>p2 &lt;= p1</code>, then a good trader should just hold the money in the pocket, neither to buy nor sell any stock.</p>\n</li>\n</ul>\n<p>With the above strategies, as one can see, we would <em>perfectly</em> capitalize at each right moment, meanwhile avoiding any loss. At the end, the accumulative profits that we gain over the time would reach the maximum.</p>\n<p></p>\n<p>With the same example above, we would buy at the moment of <code>t1</code> and sell it at the moment of <code>t2</code>. Similarly, we would also buy at the moment of <code>t2</code> and sell the moment of <code>t3</code>. As one might notice, the profits we gain from these two transactions are equivalent to the single transaction of buying at the moment of <code>t1</code> and selling at the moment of <code>t3</code>.</p>\n<p>The above strategy would be the solution for the second problem of series, <em>i.e.</em> <a href=\"https://leetcode.com/problems/best-time-to-buy-and-sell-stock-ii/\">Best Time to Buy and Sell Stock II</a> where there is no limit on the number of transactions.<br/>\n<br/><br/>\n<br/></p>\n<hr/>\n<h3><a href=\"#approach-1-bidirectional-dynamic-programming\"><svg><path></path></svg></a>Approach 1: Bidirectional Dynamic Programming</h3>\n<p><strong>Intuition</strong></p>\n<p>The only difference between this problem and the previous two problems is that in this problem we are allowed to make <strong>at most two</strong> transactions.</p>\n<p>Additionally, there is a constraint on the order of transactions stated in the problem description as follows:</p>\n<blockquote>\n<p>You may not engage in multiple transactions at the same time, (<em>i.e.</em> you must sell the stock before you buy again).</p>\n</blockquote>\n<p>We could interpret this constraint as that there would be <strong>no overlapping</strong> in the sequence of transactions.</p>\n<p></p>\n<p>In other words, the two transactions that we should make would situate in two different subsequences of the stock prices, without any overlapping, which we illustrate in the above graph.</p>\n<blockquote>\n<p>That being said, we can solve the problem in a <strong>divide-and-conquer</strong> manner, where we divide the original sequence of prices into two subsequences and then we calculate the maximum profit that we could gain from making a single transaction in each subsequence.</p>\n</blockquote>\n<p>The total profits would be the sum of profits from each subsequence. If we enumerate all possible divisions (or we could consider them as combinations of subsequences), we could find the maximum total profits among them, which is also the desired result of the problem.</p>\n<p></p>\n<p>So we divide this problem into two subproblems, and each subproblem is actually of the same problem of <a href=\"https://leetcode.com/problems/best-time-to-buy-and-sell-stock/\">Best Time to Buy and Sell Stock</a> as we discussed in the overview section.</p>\n<p><strong>Algorithm</strong></p>\n<p>A naive implementation of the above idea would be to divide the sequences into two and then enumerate each of the subsequences, though this is definitely not the most optimized solution.</p>\n<p>For a sequence of length N, we would have N possible divisions (including no division), each of the elements would be visited once in each division. As a result, the overall time complexity of this naive implementation would be O(N2).</p>\n<p>We could do better than the naive O(N2) implementation. Regarding the algorithms of divide-and-conquer,<br/>\none common technique that we can apply in order to optimize the time complexity is called <strong>dynamic programming</strong> (DP) where we trade less repetitive calculation with some extra space.</p>\n<p>In dynamic programming algorithms, normally we create an array of one or two dimensions to keep the intermediate optimal results. In this problem though, we would use two arrays, with one array keeping the results of sequence from left to right and the other array keeping the results of sequence from right to left. For the sake of name, we could call it <strong><em>bidirectional dynamic programming</em></strong>.</p>\n<p></p>\n<p>First, we denote a sequence of prices as <code>Prices[i]</code>, with index starting from <code>0</code> to <code>N-1</code>. Then we define two arrays, namely <code>left_profits[i]</code> and <code>right_profits[i]</code>.</p>\n<ul>\n<li>\n<p>As suggested by the name, each element in the <code>left_profits[i]</code> array would hold the maximum profits that one can gain from doing one single transaction on the left subsequence of prices from the index zero to <code>i</code>, (<em>i.e.</em> <code>Prices[0], Prices[1], ... Prices[i]</code>).<br/>\nFor instance, for the subsequences of <code>[7, 1, 5]</code>, the corresponding <code>left_profits[2]</code> would be 4, which is to buy the price of 1 and sell it at the price of 5.</p>\n<br/>\n</li>\n<li>\n<p>And each element in the <code>right_profits[i]</code> array would hold the maximum profits that one can gain from doing one single transaction on the right subsequence of the prices from the index <code>i</code> up to <code>N-1</code>, (<em>i.e.</em> <code>Prices[i], Prices[i+1], ... Prices[N-1]</code>).<br/>\nFor example, for the right subsequence of <code>[3, 6, 4]</code>, the corresponding <code>right_profits[3]</code> would be 3, which is to buy at the price of 3 and then sell it at the price of 6.</p>\n</li>\n</ul>\n<p>Now, if we divide the sequence of prices around the element at the index <code>i</code>, into two subsequences, with left subsequences as <code>Prices[0], Prices[1], ... Prices[i]</code> and the right subsequence as <code>Prices[i+1], ... Prices[N-1]</code>,<br/>\nthen the total maximum profits that we obtain from this division (denoted as <code>max_profits[i]</code>) can be expressed as follows:<br/>\nmax_profits[i]=left_profits[i]+right_profits[i+1]</p>\n<blockquote>\n<p>Then if we exhaust all possible divisions, <em>i.e.</em> we place the two transactions in all possible combinations of subsequences, we would then obtain the global maximum profits that we could gain from this sequence of stock prices, which can be expressed as follows:<br/>\nmaxi=[0,N)​(max_profits[i])</p>\n</blockquote>\n<p>We demonstrate how the DP arrays are calculated in the following animation.</p>\n<p></p>\n<p>Following the above idea, Here are some sample implementations.</p>\n<pre><code>class Solution {\n    public int maxProfit(int[] prices) {\n        int length = prices.length;\n        if (length &lt;= 1) return 0;\n\n        int leftMin = prices[0];\n        int rightMax = prices[length - 1];\n\n        int[] leftProfits = new int[length];\n        // pad the right DP array with an additional zero for convenience.\n        int[] rightProfits = new int[length + 1];\n\n        // construct the bidirectional DP array\n        for (int l = 1; l &lt; length; ++l) {\n            leftProfits[l] = Math.max(leftProfits[l - 1], prices[l] - leftMin);\n            leftMin = Math.min(leftMin, prices[l]);\n\n            int r = length - 1 - l;\n            rightProfits[r] = Math.max(rightProfits[r + 1], rightMax - prices[r]);\n            rightMax = Math.max(rightMax, prices[r]);\n        }\n\n        int maxProfit = 0;\n        for (int i = 0; i &lt; length; ++i) {\n            maxProfit = Math.max(maxProfit, leftProfits[i] + rightProfits[i + 1]);\n        }\n        return maxProfit;\n    }\n}</code></pre>\n<p>In the above implementations, we refined the code a bit to make it a bit more concise and hopefully more intuitive. Here are some tweaks that we applied.</p>\n<ul>\n<li>\n<p>Rather than constructing the two DP arrays in two separate loops, we do the calculation in a single loop (two birds with one stone).</p>\n<br/>\n</li>\n<li>\n<p>We pad the <code>right_profits[i]</code> array with an additional zero, which indicates the maximum profits that we can gain from an empty right subsequence, so that we can compare the result of having only one transaction (<em>i.e.</em> <code>left_profits[N-1]</code>) with the profits gained from doing two transactions.</p>\n</li>\n</ul>\n<p>By the way, one can try the above algorithm on another problem called <a href=\"https://leetcode.com/articles/sliding-window-maximum/\">Sliding Window Maximum</a>.</p>\n<p><strong>Complexity</strong></p>\n<ul>\n<li>\n<p>Time Complexity: O(N) where N is the length of the input sequence, since we have two iterations of length N.</p>\n<br/>\n</li>\n<li>\n<p>Space Complexity: O(N) for the two arrays that we keep in the algorithm.</p>\n<br/>\n</li>\n</ul>\n<br/>\n<hr/>\n<h3><a href=\"#approach-2-one-pass-simulation\"><svg><path></path></svg></a>Approach 2: One-pass Simulation</h3>\n<p><strong>Intuition</strong></p>\n<p>Just when we think that the space complexity of O(N) is the best we can get for this problem, many users in the Discussion forum proposed a more optimized solution that reduced the space complexity to O(1), (just to name a few of them <a href=\"https://leetcode.com/problems/best-time-to-buy-and-sell-stock-iii/discuss/39611/Is-it-Best-Solution-with-O(n)-O(1).\">@weijiac</a>, <a href=\"https://leetcode.com/problems/best-time-to-buy-and-sell-stock-iii/discuss/149383/Easy-DP-solution-using-state-machine-O(n)-time-complexity-O(1)-space-complexity\">@shetty4l</a>).<br/>\nThe idea is quite brilliant, and requires only a single iteration without the additional DP arrays.</p>\n<p>The intuition is that we can consider the problem as a game, and we as agent could make at most two transactions in order to gain the maximum points (profits) from the game.</p>\n<p>The two transactions be decomposed into 4 actions: <em>\"buy of transaction #1\"</em>, <em>\"sell of transaction #1\"</em>, <em>\"buy of transaction #2\"</em> and <em>\"sell of transaction #2\"</em>.</p>\n<blockquote>\n<p>To solve the game, we simply run a simulation along the sequence of prices, at each time step, we calculate the potential outcomes for each of our actions. At the end of the simulation, the outcome of the final action <em>\"sell of transaction #2\"</em> would be the desired output of the problem.</p>\n</blockquote>\n<p></p>\n<p><strong>Algorithm</strong></p>\n<p>Overall, we run an iteration over the sequence of prices.</p>\n<p>Over the iteration, we calculate 4 variables which correspond to the costs or the profits of each action respectively, as follows:</p>\n<ul>\n<li>\n<p><code>t1_cost</code>: the <em>minimal</em> cost of buying the stock in transaction #1. The minimal cost to acquire a stock would be the minimal price value that we have seen so far at each step.</p>\n<br/>\n</li>\n<li>\n<p><code>t1_profit</code>: the <em>maximal</em> profit of selling the stock in transaction #1. Actually, at the end of the iteration, this value would be the answer for the first problem in the series, <em>i.e.</em> <a href=\"https://leetcode.com/problems/best-time-to-buy-and-sell-stock/\">Best Time to Buy and Sell Stock</a>.</p>\n<br/>\n</li>\n<li>\n<p><code>t2_cost</code>: the <em>minimal</em> cost of buying the stock in transaction #2, while taking into account the profit gained from the previous transaction #1. One can consider this as the cost of reinvestment. Similar with <code>t1_cost</code>, we try to find the lowest price so far, which in addition would be partially compensated by the profits gained from the first transaction.</p>\n<br/>\n</li>\n<li>\n<p><code>t2_profit</code>: the <em>maximal</em> profit of selling the stock in transaction #2. With the help of <code>t2_cost</code> as we prepared so far, we would find out the maximal profits with at most two transactions at each step.</p>\n</li>\n</ul>\n<pre><code>class Solution {\n    public int maxProfit(int[] prices) {\n        int t1Cost = Integer.MAX_VALUE;\n        int t2Cost = Integer.MAX_VALUE;\n        int t1Profit = 0;\n        int t2Profit = 0;\n\n        for (int price : prices) {\n            // the maximum profit if only one transaction is allowed\n            t1Cost = Math.min(t1Cost, price);\n            t1Profit = Math.max(t1Profit, price - t1Cost);\n            // re-invest the gained profit in the second transaction\n            t2Cost = Math.min(t2Cost, price - t1Profit);\n            t2Profit = Math.max(t2Profit, price - t2Cost);\n        }\n\n        return t2Profit;\n    }\n}</code></pre>\n<p><strong>Complexity</strong></p>\n<ul>\n<li>\n<p>Time Complexity: O(N), where N is the length of the input sequence.</p>\n<br/>\n</li>\n<li>\n<p>Space Complexity: O(1), only constant memory is required, which is invariant from the input sequence.</p>\n</li>\n</ul>",
        "isOfficial": true,
        "scrapedAt": "2026-02-18T08:14:55.442Z"
    }
}