{
    "questionId": "150",
    "questionFrontendId": "150",
    "title": "Evaluate Reverse Polish Notation",
    "titleSlug": "evaluate-reverse-polish-notation",
    "content": "<p>You are given an array of strings <code>tokens</code> that represents an arithmetic expression in a <a href=\"http://en.wikipedia.org/wiki/Reverse_Polish_notation\" target=\"_blank\">Reverse Polish Notation</a>.</p>\n\n<p>Evaluate the expression. Return <em>an integer that represents the value of the expression</em>.</p>\n\n<p><strong>Note</strong> that:</p>\n\n<ul>\n\t<li>The valid operators are <code>&#39;+&#39;</code>, <code>&#39;-&#39;</code>, <code>&#39;*&#39;</code>, and <code>&#39;/&#39;</code>.</li>\n\t<li>Each operand may be an integer or another expression.</li>\n\t<li>The division between two integers always <strong>truncates toward zero</strong>.</li>\n\t<li>There will not be any division by zero.</li>\n\t<li>The input represents a valid arithmetic expression in a reverse polish notation.</li>\n\t<li>The answer and all the intermediate calculations can be represented in a <strong>32-bit</strong> integer.</li>\n</ul>\n\n<p>&nbsp;</p>\n<p><strong class=\"example\">Example 1:</strong></p>\n\n<pre>\n<strong>Input:</strong> tokens = [&quot;2&quot;,&quot;1&quot;,&quot;+&quot;,&quot;3&quot;,&quot;*&quot;]\n<strong>Output:</strong> 9\n<strong>Explanation:</strong> ((2 + 1) * 3) = 9\n</pre>\n\n<p><strong class=\"example\">Example 2:</strong></p>\n\n<pre>\n<strong>Input:</strong> tokens = [&quot;4&quot;,&quot;13&quot;,&quot;5&quot;,&quot;/&quot;,&quot;+&quot;]\n<strong>Output:</strong> 6\n<strong>Explanation:</strong> (4 + (13 / 5)) = 6\n</pre>\n\n<p><strong class=\"example\">Example 3:</strong></p>\n\n<pre>\n<strong>Input:</strong> tokens = [&quot;10&quot;,&quot;6&quot;,&quot;9&quot;,&quot;3&quot;,&quot;+&quot;,&quot;-11&quot;,&quot;*&quot;,&quot;/&quot;,&quot;*&quot;,&quot;17&quot;,&quot;+&quot;,&quot;5&quot;,&quot;+&quot;]\n<strong>Output:</strong> 22\n<strong>Explanation:</strong> ((10 * (6 / ((9 + 3) * -11))) + 17) + 5\n= ((10 * (6 / (12 * -11))) + 17) + 5\n= ((10 * (6 / -132)) + 17) + 5\n= ((10 * 0) + 17) + 5\n= (0 + 17) + 5\n= 17 + 5\n= 22\n</pre>\n\n<p>&nbsp;</p>\n<p><strong>Constraints:</strong></p>\n\n<ul>\n\t<li><code>1 &lt;= tokens.length &lt;= 10<sup>4</sup></code></li>\n\t<li><code>tokens[i]</code> is either an operator: <code>&quot;+&quot;</code>, <code>&quot;-&quot;</code>, <code>&quot;*&quot;</code>, or <code>&quot;/&quot;</code>, or an integer in the range <code>[-200, 200]</code>.</li>\n</ul>\n",
    "difficulty": "Medium",
    "stats": "{\"totalAccepted\": \"1.7M\", \"totalSubmission\": \"2.9M\", \"totalAcceptedRaw\": 1660976, \"totalSubmissionRaw\": 2916123, \"acRate\": \"57.0%\"}",
    "hints": [],
    "similarQuestions": "[{\"title\": \"Basic Calculator\", \"titleSlug\": \"basic-calculator\", \"difficulty\": \"Hard\", \"translatedTitle\": null}, {\"title\": \"Expression Add Operators\", \"titleSlug\": \"expression-add-operators\", \"difficulty\": \"Hard\", \"translatedTitle\": null}]",
    "topicTags": [
        {
            "name": "Array",
            "slug": "array"
        },
        {
            "name": "Math",
            "slug": "math"
        },
        {
            "name": "Stack",
            "slug": "stack"
        }
    ],
    "companyTags": null,
    "codeSnippets": [
        {
            "lang": "Java",
            "langSlug": "java",
            "code": "class Solution {\n    public int evalRPN(String[] tokens) {\n        \n    }\n}"
        }
    ],
    "solution": {
        "content": "<h2><a href=\"#solution\"><svg><path></path></svg></a>Solution</h2>\n<p>If you've attempted this question and can't figure out why you're getting wrong answers, here are a couple of things to check <em>before</em> reading the article:</p>\n<ol>\n<li>\n<p>Reverse Polish Notation <strong>is not a \"reverse\" form of Polish Notation</strong>. It is a bit different.</p>\n</li>\n<li>\n<p>If you're using Java, note that <strong>the input type is an array of strings</strong>, <em>not</em> an array of chars. This means that you should be comparing them with <code>.equals(...)</code>, <em>not</em> <code>==</code>. If your code is working on your computer but not on Leetcode, this is probably why. <em>It is a bug in your code, not in the Leetcode platform</em>.</p>\n</li>\n<li>\n<p><strong>Some programming languages</strong> (e.g. Python, but not Java) <strong>do not truncate towards 0 with division</strong>, so you'll need to figure out how to make them do so (we'll discuss ways in the article). For example, if we put <code>-121 // 7</code> into Python, we get <code>-18</code>, but we actually wanted <code>-17</code>. If unsure about your programming language, either check the documentation or simply write a program that does <code>-121 / 7</code> (as integer division) and see which result you get.</p>\n</li>\n<li>\n<p><strong>Did you put numbers around the correct way?</strong> e.g. the test case <code>[\"12\", \"7\", \"-\"]</code> means you should calculate <code>12 - 7 = 5</code>, and <em><strong>not</strong></em> <code>7 - 12 = -5</code>. In most implementations, getting them the correct way around is not immediately obvious. If you aren't <em>certain</em> you have it right, try this test case (<code>[\"12\", \"7\", \"-]</code>) and check whether you get <code>5</code> or <code>-5</code>.</p>\n</li>\n<li>\n<p>At the time of writing this solution article, the Wikipedia article has a number of errors and sections that are confusing (in particular, parsing the list in reverse). Try to understand how Reverse Polish Notation works and then design an algorithm yourself rather than following the provided pseudocode too closely. The Introduction section of this solution article also explains how Reverse Polish Notation works.</p>\n</li>\n</ol>\n<hr/>\n<h3><a href=\"#overview\"><svg><path></path></svg></a>Overview</h3>\n<p>We'll start with looking at what it means for integer division to truncate towards zero, and then at what Reverse Polish Notation is. Feel free to skip these sections if you already know this stuff.</p>\n<p><strong>Division between two integers should truncate towards zero</strong></p>\n<p>Early on in your programming career, you probably learned about integer division. When dividing 2 positive numbers, we always <em>truncate down</em> to the nearest integer. The non-integer values are in parenthesis afterwards for reference.</p>\n<pre><code>// Java integer division examples\nint a = 6 / 2;   // 3 (3.0)\nint b = 11 / 5;  // 2 (2.2)\nint c = 9 / 5;   // 1 (1.8)</code></pre><svg><path></path></svg>\n<p>Most programming languages do integer division by default (as opposed to float division, where decimal places are kept), and this is how they handle positive integers. Both of the following definitions could be (and are) used to describe the truncation.</p>\n<ol>\n<li>The result is truncated to a <em>less than or equal number</em>. i.e. <code>1</code> is less than <code>1.8</code>.</li>\n<li>The truncation is towards zero, i.e. <code>1</code> is closer to zero than <code>1.8</code> is.</li>\n</ol>\n<p>For negative numbers however, it is <em>impossible</em> to satisfy both of these, so one or the other has to be picked. For example, consider the following:</p>\n<pre><code>// Java example with negative division\nint x = -9 / 5; // ? (-1.8)</code></pre><svg><path></path></svg>\n<ol>\n<li>If we wanted the truncated result to be <em>smaller</em>, we'd have to go to <code>-2</code>, as <code>-2 &lt; -1</code>.</li>\n<li>If we wanted the truncated result to be <em>nearer to zero</em>, we'd have to go to <code>-1</code> as <code>-1</code> is nearer to zero than <code>-2</code> is.</li>\n</ol>\n<p>Some programming languages go with the first definition, and others go with the second. For this problem, you are expected to go with the second definition, regardless of what your chosen programming language uses.</p>\n<p>Python, for example, goes with the first definition. This means that we need to find a way of doing the division. Luckily, the <code>int(...)</code> function <em>does</em> truncate towards zero, and therefore we can use the <code>int(a / b)</code> trick. Note that this is <em>not</em> the same as <code>int(a // b)</code>. We haven't checked what all the programming languages available on Leetcode do, so if your chosen programming language is not truncating division towards zero, have a look in the math libraries for your chosen programming language or do a web search.</p>\n<p><strong>What is Infix Notation?</strong></p>\n<p>Analysing Infix Notation provides some great context for understanding Reverse Polish Notation.</p>\n<p>Most people know how to read expressions written using Infix Notation. Evaluating the following expression is something you will have learned to do in elementary school.</p>\n<pre><code>// Infix notation example\nint result = 3 + 1 + 9 - 5; // 8</code></pre><svg><path></path></svg>\n<p>This isn't too difficult. However, many of you will also have seen viral posts circulating social media websites, such as Facebook, that challenge you to evaluate an expression like:</p>\n<pre><code>// Another infix expression\ndouble value = 5 * 4 + 9 - 2.0 / 3 + 1; // ?</code></pre><svg><path></path></svg>\n<p>When you check the comments, among many other strange answers, you'll probably see people arguing about whether the answer is <code>10</code>, <code>27.33</code>, or <code>29.33</code>.</p>\n<p>The reason for the disagreement is because different people have different understandings about how such an expression should be evaluated.</p>\n<p>Those who say the answer is <code>10</code> evaluated it strictly from left to right, with the following steps:</p>\n<pre><code>// Left-to-right evaluation\nint step1 = 5 * 4;      // 20\nint step2 = step1 + 9; // 29\nint step3 = step2 - 2; // 27\nint step4 = step3 / 3; // 9\nint step5 = step4 + 1; // 10</code></pre><svg><path></path></svg>\n<p>Those who say the answer is <code>27.33</code> follow a rule where we evaluate operations in the following order; division, multiplication, addition, and subtraction. This method comes from a common misunderstanding of the widely used mnemonics: PEMDAS/BODMAS/BEDMAS. The steps with this method are as follows:</p>\n<pre><code>// Incorrect PEMDAS interpretation\ndouble a = 2.0 / 3;        // 0.66\ndouble b = 5 * 4;          // 20\ndouble c = b + 9;          // 29\ndouble d = c - a + 1;      // 27.33</code></pre><svg><path></path></svg>\n<p>Those who say the answer is <code>29.33</code> use the rules most programming languages use, and that is also the correct interpretation of the mnemonics (PEMDAS/BODMAS/BEDMAS). That is to do division <em>and</em> multiplication first, in order from left to right, and then addition <em>and</em> subtraction, in order from left to right. Their steps are as follows:</p>\n<pre><code>// Correct precedence evaluation\ndouble a1 = 5 * 4;         // 20\ndouble a2 = 2.0 / 3;       // 0.66\ndouble a3 = a1 + 9;        // 29\ndouble a4 = a3 - a2;       // 28.33\ndouble a5 = a4 + 1;        // 29.33</code></pre><svg><path></path></svg>\n<p>Most mathematicians would agree that the correct answer is <code>29.33</code>. Yet, this is probably not the answer you'd get if you asked a random sample of people in the general public (just look at the Facebook posts!). In school for example, I was taught the method that gives <code>28.33</code>. It wasn't until I learned programming in university that I learned the correct way!</p>\n<p>When we want to do the operations in a different order, we use parenthesis (brackets) around the parts to do first. The parts in parenthesis are always done before the parts outside.</p>\n<p>The big <em>disadvantage</em> of <strong>Infix Notation</strong> is hopefully clear now. The rules for evaluating it are surprisingly complex, cause a lot of confusion, and in fact most people don't understand them properly. Additionally, the need to use parentheses correctly adds another layer of complexity.</p>\n<p>As we move towards understanding what <strong>Reverse Polish Notation</strong> is, keep in mind that while it seems a bit strange and un-intuitive (at first!), that <strong>Infix Notation</strong> is actually more confusing. The <em>only</em> reason Infix Notation seems intuitive is because you've probably been using it all your life and so it is now second nature to you. People who use Reverse Polish Notation on a daily basis find it very intuitive! Some hand-held calculators still use it!</p>\n<p><strong>What is Reverse Polish Notation?</strong></p>\n<p>Just like Infix Notation, or in fact any other notation, <strong>Reverse Polish Notation</strong> has rules for how to evaluate it. You'll need to know these rules before you can write an algorithm. The rules could either be prior knowledge or supplied by an interviewer.</p>\n<blockquote>\n<p>While there are operators remaining in the list, find the left-most operator. Apply it to the 2 numbers immediately before it, and replace all 3 tokens (the operator and 2 numbers) with the result.</p>\n</blockquote>\n<p>For example in the most simplest case of <code>3 4 +</code> when we reach <code>+</code> we can replace <code>3 4 +</code> with it's result <code>7</code>.</p>\n<p>As long as the input was valid, this rule will always work and leave a <em>single number</em> that should be returned. The leftmost operator that hasn't yet been removed will <em>always</em> have 2 numbers immediately before it.</p>\n<p>Here is an animation showing a more complicated example.</p>\n<p></p>\n<p>Hopefully the advantage is obvious now. Reverse Polish Notation doesn't require brackets, and the rules for evaluating it are far simpler. In-fact, our <a href=\"https://leetcode.com/problems/basic-calculator-iii/\">equivalent question for Infix Notation</a> is much more difficult than this one!</p>\n<br/>\n<hr/>\n<h3><a href=\"#approach-1-reducing-the-list-in-place\"><svg><path></path></svg></a>Approach 1: Reducing the List In-place</h3>\n<h4>Intuition</h4>\n<p>This approach literally follows the animation above. A pointer is used to step through the list, and each time an operator (`+-*/) is found, that operator is then applied to the 2 values before it (which are always numbers, as long as the original input was valid). The 3 values are then replaced with the result. This process is repeated until the list is of length 1, containing a single number that is the answer to be returned.</p>\n<h4>Algorithm</h4>\n<p>The code is simpler for Python than Java. For Java (and other languages where the input type is a fixed size array), we have to define our own method to delete values from an array. This is done by shuffling the other elements down into the gap. Of course, you could start by copying the input into an <code>ArrayList</code> (so that you could then use its delete method), but then the algorithm would require O(n) space instead of O(1) space.</p>\n<p></p>\n<p>We have to be a little careful about the types in the Python code, as in the middle of processing the list, some numbers will be represent as strings, and others as ints. Additionally, we also need to be aware that <em>python division does not truncate towards zero</em>. We can instead use <code>int(a / b)</code> to achieve the desired result. Note that this is <em>not</em> the same as <code>int(a // b)</code>.</p>\n<p>In the Java code, we have to convert ints back to Strings, because Java doesn't support mixed lists of Strings and ints.</p>\n<p>Finally, If you know how to use <code>lambda</code> functions in your chosen programming language, an ideal solution would use them to elegantly handle the 4 operations (<code>+-*/</code>). The first set of solutions here use <code>lambda</code> functions. If you aren't familiar with <code>lambda</code> functions though (or your chosen programming language doesn't support them), that's fine. You'll get a chance to learn them when you're ready! Scroll down a little more, as we have also provided solutions that don't use them.</p>\n<h4>Implementation</h4>\n<pre><code>import java.util.*;\nimport java.util.function.BiFunction;\n\nclass Solution {\n    private static final Map&lt;String, BiFunction&lt;Integer, Integer, Integer&gt;&gt; OPERATIONS =\n            new HashMap&lt;&gt;();\n\n    static {\n        OPERATIONS.put(\"+\", (a, b) -&gt; a + b);\n        OPERATIONS.put(\"-\", (a, b) -&gt; a - b);\n        OPERATIONS.put(\"*\", (a, b) -&gt; a * b);\n        OPERATIONS.put(\"/\", (a, b) -&gt; a / b);\n    }\n\n    public int evalRPN(List&lt;String&gt; tokens) {\n        int currentPosition = 0;\n        while (tokens.size() &gt; 1) {\n            while (!OPERATIONS.containsKey(tokens.get(currentPosition))) {\n                currentPosition++;\n            }\n            String operation = tokens.get(currentPosition);\n            int number1 = Integer.parseInt(tokens.get(currentPosition - 2));\n            int number2 = Integer.parseInt(tokens.get(currentPosition - 1));\n            int value = OPERATIONS.get(operation).apply(number1, number2);\n            tokens.set(currentPosition, String.valueOf(value));\n            tokens.remove(currentPosition - 1);\n            tokens.remove(currentPosition - 2);\n            currentPosition--;\n        }\n        return Integer.parseInt(tokens.get(0));\n    }\n}</code></pre>\n<p>Here are the solutions without the use of <code>lambda</code> functions.</p>\n<pre><code>import java.util.*;\n\nclass Solution {\n    public int evalRPN(List&lt;String&gt; tokens) {\n        int position = 0;\n        while (tokens.size() &gt; 1) {\n            while (!tokens.get(position).equals(\"+\") &&\n                   !tokens.get(position).equals(\"-\") &&\n                   !tokens.get(position).equals(\"*\") &&\n                   !tokens.get(position).equals(\"/\")) {\n                position++;\n            }\n            int number1 = Integer.parseInt(tokens.get(position - 2));\n            int number2 = Integer.parseInt(tokens.get(position - 1));\n            int newValue = 0;\n            if (tokens.get(position).equals(\"+\")) {\n                newValue = number1 + number2;\n            } else if (tokens.get(position).equals(\"-\")) {\n                newValue = number1 - number2;\n            } else if (tokens.get(position).equals(\"*\")) {\n                newValue = number1 * number2;\n            } else if (tokens.get(position).equals(\"/\")) {\n                newValue = number1 / number2;\n            }\n            tokens.set(position, String.valueOf(newValue));\n            tokens.remove(position - 1);\n            tokens.remove(position - 2);\n            position--;\n        }\n        return Integer.parseInt(tokens.get(0));\n    }\n}</code></pre>\n<h4>Complexity Analysis</h4>\n<p>Let n be the length of the list.</p>\n<ul>\n<li>\n<p>Time Complexity : O(n2).</p>\n<p>Firstly, it helps to calculate how many <em>operators</em> and how many <em>numbers</em> are in the initial list. Each step of the algorithm removes 1 operator, 2 numbers, and adds back 1 number. This is an overall loss of 1 number and 1 operator per step. At the end, we have 1 number left. Therefore, we can infer that at the start, there must always be <strong>exactly 1 more number than there is operators</strong>.</p>\n<p>The big inefficiency of this approach is more obvious in the Java code than the Python. Deleting an item from an ArrayList or Array is O(n), because all the items after have to be shuffled down one place to fill in the gap. The number of these deletions we need to do is the same as the number of operators, which is proportional to n. Therefore, the cost of the deletions is O(n2).</p>\n<p>This is more obvious in the Java code, because we had to define the deletion method ourselves. However, the Python deletion method works the same way, it's just that you can't see it because it's hidden in a library function call. It's important to always be aware of the cost of library functions as they can sometimes look like they're O(1) when they're not!</p>\n</li>\n<li>\n<p>Space Complexity : O(1).</p>\n<p>The only extra space used is a constant number of single-value variables. Therefore, the overall algorithm requires O(1) space.</p>\n</li>\n</ul>\n<p>Interestingly, this approach could be adapted to work with a <strong>Double-Linked List</strong>. It would require O(n) space to create the list, and then take O(n) time to process it using a similar algorithm to above. This works because the algorithm is traversing the list in a linear fashion and modifications only impact the tokens immediately to the left of the current token.</p>\n<br/>\n<hr/>\n<h3><a href=\"#approach-2-evaluate-with-stack\"><svg><path></path></svg></a>Approach 2: Evaluate with Stack</h3>\n<h4>Intuition</h4>\n<p>The first approach worked, but O(n2) is too slow for large n. As hinted at above, a <strong>Double-Linked List</strong> could be an option. However, it requires a lot of set-up code, and in practice requires more space than the elegant <strong>Stack</strong> approach we're going to look at now.</p>\n<p>We don't want to repeatedly delete items from the middle of a list, as this inevitably leads to O(n2) time performance. So recall that the above algorithm scanned through the list from left to right, and each time it reached an operator, it'd replace the operator and the 2 numbers immediately before it with the result of applying the operator to the 2 numbers.</p>\n<p>The two key steps of the above algorithm were:</p>\n<ol>\n<li>Visit each operator, in linear order. Finding these can be done with a linear search of the original list.</li>\n<li>Get the 2 most recently seen numbers that haven't yet been replaced. These could be tracked using a <strong>Stack</strong>.</li>\n</ol>\n<h4>Algorithm</h4>\n<p>The algorithm would be as follows:</p>\n<pre><code>Stack&lt;Integer&gt; stack = new Stack&lt;&gt;();\nfor (String token : tokens) {\n    if (isNumber(token)) {\n        stack.push(Integer.parseInt(token));\n    } else {\n        int number2 = stack.pop();\n        int number1 = stack.pop();\n        int result = applyOperator(token, number1, number2);\n        stack.push(result);\n    }\n}\nreturn stack.pop();</code></pre><svg><path></path></svg>\n<p>Here is an animation showing the algorithm.</p>\n<p></p>\n<p>You might have noticed the following 2 lines of the pseudocode could look like they're around the wrong way.</p>\n<pre><code>int number2 = stack.pop();\nint number1 = stack.pop();</code></pre><svg><path></path></svg>\n<p>They are correct though. Remember that for division and subtraction, the order of the numbers matters. i.e. <code>7 - 5 ≠ 5 - 7</code>. On the <code>Stack</code>, we have the <em>second</em> on the top. So we need to reverse them before applying the operator.</p>\n<h4>Implementation</h4>\n<p>Here is code that uses <code>lambda</code> functionality. Scroll down for code that doesn't.</p>\n<pre><code>import java.util.*;\nimport java.util.function.BiFunction;\n\nclass Solution {\n    public int evalRPN(String[] tokens) {\n        Map&lt;String, BiFunction&lt;Integer, Integer, Integer&gt;&gt; operations = new HashMap&lt;&gt;();\n        operations.put(\"+\", (a, b) -&gt; a + b);\n        operations.put(\"-\", (a, b) -&gt; a - b);\n        operations.put(\"*\", (a, b) -&gt; a * b);\n        operations.put(\"/\", (a, b) -&gt; a / b);\n\n        Stack&lt;Integer&gt; stack = new Stack&lt;&gt;();\n        for (String token : tokens) {\n            if (!operations.containsKey(token)) {\n                stack.push(Integer.parseInt(token));\n            } else {\n                int op2 = stack.pop();\n                int op1 = stack.pop();\n                int result = operations.get(token).apply(op1, op2);\n                stack.push(result);\n            }\n        }\n        return stack.pop();\n    }\n}</code></pre>\n<p>Here are the solutions without <code>lambda</code>.</p>\n<pre><code>import java.util.*;\n\nclass Solution {\n    public int evalRPN(String[] tokens) {\n        Stack&lt;Integer&gt; stack = new Stack&lt;&gt;();\n        for (String token : tokens) {\n            if (!token.equals(\"+\") && !token.equals(\"-\") &&\n                !token.equals(\"*\") && !token.equals(\"/\")) {\n                stack.push(Integer.parseInt(token));\n                continue;\n            }\n            int number2 = stack.pop();\n            int number1 = stack.pop();\n            int result = 0;\n            if (token.equals(\"+\")) {\n                result = number1 + number2;\n            } else if (token.equals(\"-\")) {\n                result = number1 - number2;\n            } else if (token.equals(\"*\")) {\n                result = number1 * number2;\n            } else if (token.equals(\"/\")) {\n                result = number1 / number2;\n            }\n            stack.push(result);\n        }\n        return stack.pop();\n    }\n}</code></pre>\n<h4>Complexity Analysis</h4>\n<p>Let n be the length of the list.</p>\n<ul>\n<li>\n<p>Time Complexity : O(n).</p>\n<p>We do a linear search to put all numbers on the stack, and process all operators. Processing an operator requires removing 2 numbers off the stack and replacing them with a single number, which is an O(1) operation. Therefore, the total cost is proportional to the length of the input array. Unlike before, we're no longer doing expensive deletes from the middle of an Array or List.</p>\n</li>\n<li>\n<p>Space Complexity : O(n).</p>\n<p>In the worst case, the stack will have all the numbers on it at the same time. This is never more than half the length of the input array.</p>\n</li>\n</ul>\n<br/>",
        "isOfficial": true,
        "scrapedAt": "2026-02-18T08:09:33.476Z"
    }
}