{
    "questionId": "160",
    "questionFrontendId": "160",
    "title": "Intersection of Two Linked Lists",
    "titleSlug": "intersection-of-two-linked-lists",
    "content": "<p>Given the heads of two singly linked-lists <code>headA</code> and <code>headB</code>, return <em>the node at which the two lists intersect</em>. If the two linked lists have no intersection at all, return <code>null</code>.</p>\n\n<p>For example, the following two linked lists begin to intersect at node <code>c1</code>:</p>\n<img alt=\"\" src=\"images/160/160_statement.png\" style=\"width: 500px; height: 162px;\" />\n<p>The test cases are generated such that there are no cycles anywhere in the entire linked structure.</p>\n\n<p><strong>Note</strong> that the linked lists must <strong>retain their original structure</strong> after the function returns.</p>\n\n<p><strong>Custom Judge:</strong></p>\n\n<p>The inputs to the <strong>judge</strong> are given as follows (your program is <strong>not</strong> given these inputs):</p>\n\n<ul>\n\t<li><code>intersectVal</code> - The value of the node where the intersection occurs. This is <code>0</code> if there is no intersected node.</li>\n\t<li><code>listA</code> - The first linked list.</li>\n\t<li><code>listB</code> - The second linked list.</li>\n\t<li><code>skipA</code> - The number of nodes to skip ahead in <code>listA</code> (starting from the head) to get to the intersected node.</li>\n\t<li><code>skipB</code> - The number of nodes to skip ahead in <code>listB</code> (starting from the head) to get to the intersected node.</li>\n</ul>\n\n<p>The judge will then create the linked structure based on these inputs and pass the two heads, <code>headA</code> and <code>headB</code> to your program. If you correctly return the intersected node, then your solution will be <strong>accepted</strong>.</p>\n\n<p>&nbsp;</p>\n<p><strong class=\"example\">Example 1:</strong></p>\n<img alt=\"\" src=\"images/160/160_example_1_1.png\" style=\"width: 500px; height: 162px;\" />\n<pre>\n<strong>Input:</strong> intersectVal = 8, listA = [4,1,8,4,5], listB = [5,6,1,8,4,5], skipA = 2, skipB = 3\n<strong>Output:</strong> Intersected at &#39;8&#39;\n<strong>Explanation:</strong> The intersected node&#39;s value is 8 (note that this must not be 0 if the two lists intersect).\nFrom the head of A, it reads as [4,1,8,4,5]. From the head of B, it reads as [5,6,1,8,4,5]. There are 2 nodes before the intersected node in A; There are 3 nodes before the intersected node in B.\n- Note that the intersected node&#39;s value is not 1 because the nodes with value 1 in A and B (2<sup>nd</sup> node in A and 3<sup>rd</sup> node in B) are different node references. In other words, they point to two different locations in memory, while the nodes with value 8 in A and B (3<sup>rd</sup> node in A and 4<sup>th</sup> node in B) point to the same location in memory.\n</pre>\n\n<p><strong class=\"example\">Example 2:</strong></p>\n<img alt=\"\" src=\"images/160/160_example_2.png\" style=\"width: 500px; height: 194px;\" />\n<pre>\n<strong>Input:</strong> intersectVal = 2, listA = [1,9,1,2,4], listB = [3,2,4], skipA = 3, skipB = 1\n<strong>Output:</strong> Intersected at &#39;2&#39;\n<strong>Explanation:</strong> The intersected node&#39;s value is 2 (note that this must not be 0 if the two lists intersect).\nFrom the head of A, it reads as [1,9,1,2,4]. From the head of B, it reads as [3,2,4]. There are 3 nodes before the intersected node in A; There are 1 node before the intersected node in B.\n</pre>\n\n<p><strong class=\"example\">Example 3:</strong></p>\n<img alt=\"\" src=\"images/160/160_example_3.png\" style=\"width: 300px; height: 189px;\" />\n<pre>\n<strong>Input:</strong> intersectVal = 0, listA = [2,6,4], listB = [1,5], skipA = 3, skipB = 2\n<strong>Output:</strong> No intersection\n<strong>Explanation:</strong> From the head of A, it reads as [2,6,4]. From the head of B, it reads as [1,5]. Since the two lists do not intersect, intersectVal must be 0, while skipA and skipB can be arbitrary values.\nExplanation: The two lists do not intersect, so return null.\n</pre>\n\n<p>&nbsp;</p>\n<p><strong>Constraints:</strong></p>\n\n<ul>\n\t<li>The number of nodes of <code>listA</code> is in the <code>m</code>.</li>\n\t<li>The number of nodes of <code>listB</code> is in the <code>n</code>.</li>\n\t<li><code>1 &lt;= m, n &lt;= 3 * 10<sup>4</sup></code></li>\n\t<li><code>1 &lt;= Node.val &lt;= 10<sup>5</sup></code></li>\n\t<li><code>0 &lt;= skipA &lt;= m</code></li>\n\t<li><code>0 &lt;= skipB &lt;= n</code></li>\n\t<li><code>intersectVal</code> is <code>0</code> if <code>listA</code> and <code>listB</code> do not intersect.</li>\n\t<li><code>intersectVal == listA[skipA] == listB[skipB]</code> if <code>listA</code> and <code>listB</code> intersect.</li>\n</ul>\n\n<p>&nbsp;</p>\n<strong>Follow up:</strong> Could you write a solution that runs in <code>O(m + n)</code> time and use only <code>O(1)</code> memory?",
    "difficulty": "Easy",
    "stats": "{\"totalAccepted\": \"2.3M\", \"totalSubmission\": \"3.6M\", \"totalAcceptedRaw\": 2298268, \"totalSubmissionRaw\": 3639953, \"acRate\": \"63.1%\"}",
    "hints": [],
    "similarQuestions": "[{\"title\": \"Minimum Index Sum of Two Lists\", \"titleSlug\": \"minimum-index-sum-of-two-lists\", \"difficulty\": \"Easy\", \"translatedTitle\": null}]",
    "topicTags": [
        {
            "name": "Hash Table",
            "slug": "hash-table"
        },
        {
            "name": "Linked List",
            "slug": "linked-list"
        },
        {
            "name": "Two Pointers",
            "slug": "two-pointers"
        }
    ],
    "companyTags": null,
    "codeSnippets": [
        {
            "lang": "Java",
            "langSlug": "java",
            "code": "/**\n * Definition for singly-linked list.\n * public class ListNode {\n *     int val;\n *     ListNode next;\n *     ListNode(int x) {\n *         val = x;\n *         next = null;\n *     }\n * }\n */\npublic class Solution {\n    public ListNode getIntersectionNode(ListNode headA, ListNode headB) {\n        \n    }\n}"
        }
    ],
    "solution": {
        "content": "<h2><a href=\"#solution-article\"><svg><path></path></svg></a>Solution Article</h2>\n<hr/>\n<h3><a href=\"#overview\"><svg><path></path></svg></a>Overview</h3>\n<p>For this article, we're assuming that you know what a <strong>linked list</strong> is, and can solve <em>very</em> basic linked list problems such as determining the length of a given linked list. If you're not yet at that level, we recommend checking out our <a href=\"https://leetcode.com/explore/learn/card/linked-list/\">Explore Card on linked lists</a>.</p>\n<p>We'll be referring to the linked list starting at <code>headA</code> as \"list A\" and the linked list starting at <code>headB</code> as \"list B\".</p>\n<br/>\n<hr/>\n<h3><a href=\"#approach-1-brute-force\"><svg><path></path></svg></a>Approach 1: Brute Force</h3>\n<p><strong>Intuition and Algorithm</strong></p>\n<p>The brute force solution is often a good starting point in an interview. While you shouldn't actually code up this approach (it's not a good use of time to do so), you should briefly explain it to your interviewer. Once you've done that, you'll then be analyzing inefficiencies and coming up with ways to optimize it.</p>\n<p>The brute force solution here is nothing too special: For each node in list A, traverse over list B and check whether or not the node is present in list B.</p>\n<p>The one thing we need to be careful of is that we're comparing objects of type <code>Node</code>. We don't want to compare the values within the nodes; doing this would cause our code to break when two different nodes have the same value.</p>\n<p><strong>Implementation</strong></p>\n<p>Note that we're only showing this code for your reference. This is <em>not a good approach for an interview</em>, and the only reason we discussed it at all as we will be optimizing it in Approach 2. For this reason, we aren't guaranteeing that the code will pass our judge in every language.</p>\n<pre><code>class Solution {\n    public ListNode getIntersectionNode(ListNode headA, ListNode headB) {\n        while (headA != null) {\n            ListNode pB = headB;\n            while (pB != null) {\n                if (headA == pB) return headA;\n                pB = pB.next;\n            }\n            headA = headA.next;\n        }\n        return null;\n    }\n}</code></pre>\n<p><strong>Complexity Analysis</strong></p>\n<p>Let N be the length of list A and M be the length of list B.</p>\n<ul>\n<li>\n<p>Time complexity : O(N×M).</p>\n<p>For <em>each</em> of the N nodes in list A, we are traversing over <em>each</em> of the nodes in list B. In the worst case, we won't find a match, and so will need to do this until reaching the end of list B, giving a worst-case time complexity of O(N×M).</p>\n</li>\n<li>\n<p>Space complexity : O(1).</p>\n<p>We aren't allocating any additional data structures, so the amount of extra space used does not grow with the size of the input.</p>\n</li>\n</ul>\n<br/>\n<hr/>\n<h3><a href=\"#approach-2-hash-table\"><svg><path></path></svg></a>Approach 2: Hash Table</h3>\n<p><strong>Intuition</strong></p>\n<p>If you are unfamiliar with hash tables, check out our <a href=\"https://leetcode.com/explore/learn/card/hash-table/182/practical-applications/1109/\">Explore Card</a>.</p>\n<p>Approach 1 is inefficient because we repeatedly traverse over list B to check whether or not any of the nodes in list B were equal to the current one we were looking at in list A. Instead of repeatedly traversing through list B though, we could simply traverse it once and store each node in a hash table. We could then traverse through list A once, each time checking whether the current node exists in the hash table.</p>\n<p><strong>Algorithm</strong></p>\n<p>Traverse list B and store the address/reference of each node in a hash table. Then for each node in list A, check whether or not that node exists in the hash table. If it does, return it as it must be the intersection node. If we get to the end of list A without finding an intersection node, return null.</p>\n<p>The one thing we need to be careful of is that we're comparing objects of type <code>Node</code>. We don't want to compare the values within the nodes; doing this would cause our code to break when two different nodes have the same value.</p>\n<p><strong>Implementation</strong></p>\n<pre><code>import java.util.HashSet;\nimport java.util.Set;\n\nclass Solution {\n    public ListNode getIntersectionNode(ListNode headA, ListNode headB) {\n        Set&lt;ListNode&gt; nodesInB = new HashSet&lt;&gt;();\n\n        while (headB != null) {\n            nodesInB.add(headB);\n            headB = headB.next;\n        }\n\n        while (headA != null) {\n            // if we find the node pointed to by headA,\n            // in our set containing nodes of B, then return the node\n            if (nodesInB.contains(headA)) {\n                return headA;\n            }\n            headA = headA.next;\n        }\n\n        return null;\n    }\n}</code></pre>\n<p><strong>Complexity Analysis</strong></p>\n<ul>\n<li>\n<p>Time complexity : O(N+M).</p>\n<p>Firstly, we need to build up the hash table. It costs O(1) to insert an item into a hash table, and we need to do this for each of the M nodes in list B. This gives a cost of O(M) for building the hash table.</p>\n<p>Secondly, we need to traverse list A, and for each node, we need to check whether or not it is in the hash table. In the worst case, there will not be a match, requiring us to check all N nodes in list A. As it is also O(1) to check whether or not an item is in a hash table, this checking has a total cost of O(N).</p>\n<p>Finally, combining the two parts, we get O(M)+O(N)=O(M+N).</p>\n</li>\n<li>\n<p>Space complexity : O(M).</p>\n<p>As we are storing each of the nodes from list B into a hash table, the hash table will require O(M) space. Note that we could have instead stored the nodes of list A into the hash table, this would have been a space complexity of O(N). Unless we know <em>which list is longer</em> though, it doesn't make any real difference.</p>\n</li>\n</ul>\n<br/>\n<hr/>\n<h3><a href=\"#approach-3-two-pointers\"><svg><path></path></svg></a>Approach 3: Two Pointers</h3>\n<p><strong>Intuition</strong></p>\n<blockquote>\n<p><strong>Interview Tip</strong>: Approach 3 is essentially a \"medium\" solution to an \"easy\" problem. Note that approach 2 is <em>probably</em> sufficient for an interview if you are fairly new to programming (for example, you're applying for an internship during your early years of college). If you're more experienced, it might also be sufficient, but your safest bet would be to also know Approach 3, and to be able to apply the intuition behind it to similar problems. While it might initially look scary, you'll be fine with it once you have a think about it and try and draw a few examples.</p>\n</blockquote>\n<p>We know that we've now fully optimized the time complexity: it's impossible to do better than O(N+M) as, in the worst case, we'll need to look at every node at least once. But, is there a way we can get the space complexity down to O(1) while maintaining that awesome O(N+M) time complexity that we just achieved? It turns out that there is!</p>\n<p>Observe that while list A and list B could be different lengths, that the shared \"tail\" following the intersection has to be the <em>same</em> length.</p>\n<p>Imagine that we have two linked lists, A and B, and we know that their lengths are N and M respectively (these can be calculated with O(1) space and in time proportional to the length of the list). We'll imagine that N=5 and M=8.</p>\n<p></p>\n<p>Because the \"tails\" must be the same length, we can conclude that <em>if</em> there is an intersection, then the intersection node will be one of these 5 possibilities.</p>\n<p></p>\n<p>So, to check for each of these pairs, we would start by setting a pointer at the start of the shorter list, and a pointer at the first possible matching node of the longer list. The position of this node is simply the difference between the two lengths, that is, ∣M−N∣.</p>\n<p></p>\n<p>Then, we just need to step the two pointers through the list, each time checking whether or not the nodes are the same.</p>\n<p>In code, we could write this algorithm with 4 loops, one after the other, each doing the following:</p>\n<ol>\n<li>Calculate N; the length of list A.</li>\n<li>Calculate M; the length of list B.</li>\n<li>Set the start pointer for the <em>longer</em> list.</li>\n<li>Step the pointers through the list together.</li>\n</ol>\n<p>While this would have a time complexity of O(N+M) and a space complexity of O(1) and would be fine for an interview, we can still simplify the code a bit! As some quick reassurance, most people will struggle to come up with this next part by themselves. It takes practice and seeing lots of linked list and other math problems.</p>\n<p>If we say that c is the <em>shared</em> part, a is <em>exclusive part of list A</em> and b is <em>exclusive part of list B</em>, then we can have one pointer that goes over <code>a + c + b</code> and the other that goes over <code>b + c + a</code>. Have a look at the diagram below, and this should be fairly intuitive.</p>\n<p></p>\n<p>This is the above algorithm in disguise - one pointer is essentially measuring the length of the longer list, and the other is measuring the length of the shorter list, and then placing the start pointer for the longer list. Then both are stepping through the list together. By seeing the solution in this way though, we can now implement it as a single loop.</p>\n<p><strong>Algorithm</strong></p>\n<ul>\n<li>Set pointer <code>pA</code> to point at <code>headA</code>.</li>\n<li>Set pointer <code>pB</code> to point at <code>headB</code>.</li>\n<li>While <code>pA</code> and <code>pB</code> are not pointing at the same node:\n<ul>\n<li>If <code>pA</code> is pointing to a null, set <code>pA</code> to point to <code>headB</code>.</li>\n<li>Else, set <code>pA</code> to point at <code>pA.next</code>.</li>\n<li>If <code>pB</code> is pointing to a null, set <code>pB</code> to point to <code>headA</code>.</li>\n<li>Else, set <code>pB</code> to point at <code>pB.next</code>.</li>\n</ul>\n</li>\n<li>return the value pointed to by <code>pA</code> (or by <code>pB</code>; they're the same now).</li>\n</ul>\n<p><strong>Implementation</strong></p>\n<pre><code>class Solution {\n    public ListNode getIntersectionNode(ListNode headA, ListNode headB) {\n        ListNode pA = headA;\n        ListNode pB = headB;\n\n        while (pA != pB) {\n            pA = (pA == null) ? headB : pA.next;\n            pB = (pB == null) ? headA : pB.next;\n        }\n\n        return pA;\n        // Note: In the case lists do not intersect, the pointers for A and B\n        // will still line up in the 2nd iteration, just that here won't be\n        // a common node down the list and both will reach their respective ends\n        // at the same time. So pA will be null in that case.\n    }\n}</code></pre>\n<p><strong>Complexity Analysis</strong></p>\n<p>Let N be the length of list A and M be the length of list B.</p>\n<ul>\n<li>\n<p>Time complexity : O(N+M).</p>\n<p>In the worst case, each list is traversed <strong>twice</strong> giving 2⋅M+2⋅N, which is equivalent to O(N+M). This is because the pointers firstly go down each list so that they can be \"lined up\" and then in the second iteration, the intersection node is searched for.</p>\n<p>An interesting observation you might have made is that when the lists are of the same length, this algorithm only traverses each list <strong>once</strong>. This is because the pointers are already \"lined up\" from the start, so the additional pass is unnecessary.</p>\n</li>\n<li>\n<p>Space complexity : O(1).</p>\n<p>We aren't allocating any additional data structures, so the amount of extra space used does not grow with the size of the input. For this reason, Approach 3 is better than Approach 2.</p>\n</li>\n</ul>",
        "isOfficial": true,
        "scrapedAt": "2026-02-18T07:12:18.485Z"
    }
}