{
    "questionId": "234",
    "questionFrontendId": "234",
    "title": "Palindrome Linked List",
    "titleSlug": "palindrome-linked-list",
    "content": "<p>Given the <code>head</code> of a singly linked list, return <code>true</code><em> if it is a </em><span data-keyword=\"palindrome-sequence\"><em>palindrome</em></span><em> or </em><code>false</code><em> otherwise</em>.</p>\n\n<p>&nbsp;</p>\n<p><strong class=\"example\">Example 1:</strong></p>\n<img alt=\"\" src=\"images/234/pal1linked-list.jpg\" style=\"width: 422px; height: 62px;\" />\n<pre>\n<strong>Input:</strong> head = [1,2,2,1]\n<strong>Output:</strong> true\n</pre>\n\n<p><strong class=\"example\">Example 2:</strong></p>\n<img alt=\"\" src=\"images/234/pal2linked-list.jpg\" style=\"width: 182px; height: 62px;\" />\n<pre>\n<strong>Input:</strong> head = [1,2]\n<strong>Output:</strong> false\n</pre>\n\n<p>&nbsp;</p>\n<p><strong>Constraints:</strong></p>\n\n<ul>\n\t<li>The number of nodes in the list is in the range <code>[1, 10<sup>5</sup>]</code>.</li>\n\t<li><code>0 &lt;= Node.val &lt;= 9</code></li>\n</ul>\n\n<p>&nbsp;</p>\n<strong>Follow up:</strong> Could you do it in <code>O(n)</code> time and <code>O(1)</code> space?",
    "difficulty": "Easy",
    "stats": "{\"totalAccepted\": \"2.8M\", \"totalSubmission\": \"4.9M\", \"totalAcceptedRaw\": 2788174, \"totalSubmissionRaw\": 4860363, \"acRate\": \"57.4%\"}",
    "hints": [],
    "similarQuestions": "[{\"title\": \"Palindrome Number\", \"titleSlug\": \"palindrome-number\", \"difficulty\": \"Easy\", \"translatedTitle\": null}, {\"title\": \"Valid Palindrome\", \"titleSlug\": \"valid-palindrome\", \"difficulty\": \"Easy\", \"translatedTitle\": null}, {\"title\": \"Reverse Linked List\", \"titleSlug\": \"reverse-linked-list\", \"difficulty\": \"Easy\", \"translatedTitle\": null}, {\"title\": \"Maximum Twin Sum of a Linked List\", \"titleSlug\": \"maximum-twin-sum-of-a-linked-list\", \"difficulty\": \"Medium\", \"translatedTitle\": null}]",
    "topicTags": [
        {
            "name": "Linked List",
            "slug": "linked-list"
        },
        {
            "name": "Two Pointers",
            "slug": "two-pointers"
        },
        {
            "name": "Stack",
            "slug": "stack"
        },
        {
            "name": "Recursion",
            "slug": "recursion"
        }
    ],
    "companyTags": null,
    "codeSnippets": [
        {
            "lang": "Java",
            "langSlug": "java",
            "code": "/**\n * Definition for singly-linked list.\n * public class ListNode {\n *     int val;\n *     ListNode next;\n *     ListNode() {}\n *     ListNode(int val) { this.val = val; }\n *     ListNode(int val, ListNode next) { this.val = val; this.next = next; }\n * }\n */\nclass Solution {\n    public boolean isPalindrome(ListNode head) {\n        \n    }\n}"
        }
    ],
    "solution": {
        "content": "<h2><a href=\"#solution-article\"><svg><path></path></svg></a>Solution Article</h2>\n<hr/>\n<h3><a href=\"#approach-1-copy-into-array-list-and-then-use-two-pointer-technique\"><svg><path></path></svg></a>Approach 1: Copy into Array List and then Use Two Pointer Technique</h3>\n<p><strong>Intuition</strong></p>\n<p>If you're not too familiar with <strong>Linked Lists</strong> yet, here's a quick recap on <strong>Lists</strong>.</p>\n<p>There are two commonly used <strong>List</strong> implementations, the <strong>Array List</strong> and the <strong>Linked List</strong>. If we have some values we want to store in a list, how would each List implementation hold them?</p>\n<ul>\n<li>An <strong>Array List</strong> uses an underlying <strong>Array</strong> to store the values. We can access the value at any position in the list in O(1) time, as long as we know the index. This is based on the underlying memory addressing.</li>\n<li>A <strong>Linked List</strong> uses <strong>Objects</strong> commonly called <strong>Nodes</strong>. Each <strong>Node</strong> holds a value and a <em>next</em> pointer to the next node. Accessing a node at a particular index would take O(n) time because we have to go down the list using the <em>next</em> pointers.</li>\n</ul>\n<p>Determining whether or not an <em>Array List</em> is a palindrome is straightforward. We can simply use the <strong>two-pointer technique</strong> to compare indexes at either end, moving in towards the middle. One pointer starts at the start and goes up, and the other starts at the end and goes down. This would take O(n) because each index access is O(1) and there are n index accesses in total.</p>\n<p>However, it's not so straightforward for a Linked List. Accessing the values in any order other than forward, sequentially, is <em><strong>not</strong></em> O(1). Unfortunately, this includes (iteratively) accessing the values in <em>reverse</em>. We will need a completely different approach.</p>\n<p>On the plus side, making a copy of the Linked List values into an <em>Array List</em> is O(n). Therefore, the simplest solution is to copy the values of the Linked List into an Array List (or Vector, or plain Array). Then, we can solve the problem using the <strong>two-pointer technique</strong>.</p>\n<p><strong>Algorithm</strong></p>\n<p>We can split this approach into 2 steps:</p>\n<ol>\n<li>Copying the Linked List into an Array.</li>\n<li>Checking whether or not the <em>Array</em> is a palindrome.</li>\n</ol>\n<p>To do the first step, we need to iterate through the Linked List, adding each value to an Array. We do this by using a variable <code>currentNode</code> to point at the current Node we're looking at, and at each iteration adding <code>currentNode.val</code> to the array and updating <code>currentNode</code> to point to <code>currentNode.next</code>. We should stop looping once <code>currentNode</code> points to a <code>null</code> node.</p>\n<p>The best way of doing the second step depends on the programming language you're using. In Python, it's straightforward to make a reversed copy of a list and also straightforward to compare two lists. In other languages, this is not so straightforward and so it's probably best to use the <strong>two-pointer technique</strong> to check for a palindrome. In the two-pointer technique, we put a pointer at the start and a pointer at the end, and at each step check the values are equal and then move the pointers inwards until they meet at the center.</p>\n<p>When writing your own solution, remember that we need to compare values in the nodes, not the nodes themselves. <code>node_1.val == node_2.val</code> is the <em>correct</em> way of comparing the nodes. <code>node_1 == node_2</code> will <em>not work</em> the way you expect.</p>\n<pre><code>class Solution {\n    public boolean isPalindrome(ListNode head) {\n        List&lt;Integer&gt; vals = new ArrayList&lt;&gt;();\n​\n        // Convert LinkedList into ArrayList.\n        ListNode currentNode = head;\n        while (currentNode != null) {\n            vals.add(currentNode.val);\n            currentNode = currentNode.next;\n        }\n​\n        // Use two-pointer technique to check for palindrome.\n        int front = 0;\n        int back = vals.size() - 1;\n        while (front &lt; back) {\n            // Note that we must use ! .equals instead of !=\n            // because we are comparing Integer, not int.\n            if (!vals.get(front).equals(vals.get(back))) {\n                return false;\n            }\n            front++;\n            back--;\n        }\n        return true;\n    }\n}</code></pre>\n<p><strong>Complexity Analysis</strong></p>\n<ul>\n<li>\n<p>Time complexity : O(n), where n is the number of nodes in the Linked List.</p>\n<p>In the first part, we're copying a Linked List into an Array List. Iterating down a Linked List in sequential order is O(n), and each of the n writes to the ArrayList is O(1). Therefore, the overall cost is O(n).</p>\n<p>In the second part, we're using the two pointer technique to check whether or not the Array List is a palindrome. Each of the n values in the Array list is accessed once, and a total of O(n/2) comparisons are done. Therefore, the overall cost is O(n). The Python trick (reverse and list comparison as a one liner) is also O(n).</p>\n<p>This gives O(2n)=O(n) because we always drop the constants.</p>\n</li>\n<li>\n<p>Space complexity : O(n), where n is the number of nodes in the Linked List.</p>\n<p>We are making an Array List and adding n values to it.</p>\n</li>\n</ul>\n<br/>\n<hr/>\n<h3><a href=\"#approach-2-recursive-advanced\"><svg><path></path></svg></a>Approach 2: Recursive (Advanced)</h3>\n<p><strong>Intuition</strong></p>\n<p>In an attempt to come up with a way of using O(1) space, you might have thought of using recursion. However, this is still O(n) space. Let's have a look at it and understand why it is <strong>not</strong> O(1) space.</p>\n<p>Recursion gives us an elegant way to iterate through the nodes in reverse. For example, this algorithm will print out the values of the nodes <em>in reverse</em>. Given a node, the algorithm checks if it is <code>null</code>. If it is <code>null</code>, nothing happens. Otherwise, all nodes <em>after</em> it are processed, and <em>then</em> the value for the current node is printed.</p>\n<svg><path></path></svg>\n<p>If we iterate the nodes in reverse using recursion, and iterate forward at the same time using a variable <em>outside</em> the recursive function, then we can check whether or not we have a palindrome.</p>\n<p><strong>Algorithm</strong></p>\n<p>When given the head node (or any other node), referred to as <code>currentNode</code>, the algorithm firstly checks the <em>rest</em> of the Linked List. If it discovers that further down that the Linked List is <em>not</em> a palindrome, then it returns <code>false</code>. Otherwise, it checks that <code>currentNode.val == frontPointer.val</code>. If not, then it returns <code>false</code>. Otherwise, it moves <code>frontPointer</code> forward by 1 node and returns <code>true</code> to say that from this point forward, the Linked List is a valid palindrome.</p>\n<p>It might initially seem surprisingly that <code>frontPointer</code> is always pointing where we want it. The reason it works is because the order in which nodes are processed by the recursion is in reverse (remember our \"printing\" algorithm above). Each node compares itself against <code>frontPointer</code> and then moves <code>frontPointer</code> down by 1, ready for the next node in the recursion. In essence, we are iterating both backwards and forwards at the same time.</p>\n<p>Here is an animation that shows how the algorithm works. The nodes have each been given a unique identifier (e.g. <code>$1</code> and <code>$4</code>) so that they can more easily be referred to in the explanations. The computer needs to use its runtime stack for recursive functions.</p>\n<p></p>\n<pre><code>class Solution {\n​\n    private ListNode frontPointer;\n​\n    private boolean recursivelyCheck(ListNode currentNode) {\n        if (currentNode != null) {\n            if (!recursivelyCheck(currentNode.next)) return false;\n            if (currentNode.val != frontPointer.val) return false;\n            frontPointer = frontPointer.next;\n        }\n        return true;\n    }\n​\n    public boolean isPalindrome(ListNode head) {\n        frontPointer = head;\n        return recursivelyCheck(head);\n    }\n}</code></pre>\n<p><strong>Complexity Analysis</strong></p>\n<ul>\n<li>\n<p>Time complexity : O(n), where n is the number of nodes in the Linked List.</p>\n<p>The recursive function is run once for each of the n nodes, and the body of the recursive function is O(1). Therefore, this gives a total of O(n).</p>\n</li>\n<li>\n<p>Space complexity : O(n), where n is the number of nodes in the Linked List.</p>\n<p>I hinted at the start that this is not using O(1) space. This might seem strange, after all we aren't creating any new data structures. So, where is the O(n) extra memory we're using? Understanding what is happening here requires understanding how the computer runs a recursive function.</p>\n<p>Each time a function is called within a function, the computer needs to keep track of where it is up to (and the values of any local variables) in the current function before it goes into the called function. It does this by putting an entry on something called the <strong>runtime stack</strong>, called a <strong>stack frame</strong>. Once it has created a stack frame for the current function, it can then go into the called function. Then once it is finished with the called function, it pops the top stack frame to resume the function it had been in before the function call was made.</p>\n<p>Before doing any palindrome checking, the above recursive function creates n of these stack frames because the first step of processing a node is to process the nodes after it, which is done with a recursive call. Then once it has the n stack frames, it pops them off one-by-one to process them.</p>\n<p>So, the space usage is on the <em>runtime stack</em> because we are creating n stack frames. Always make sure to consider what's going on the <em>runtime stack</em> when analyzing a recursive function. It's a common mistake to forget to.</p>\n</li>\n</ul>\n<p>Not only is this approach still using O(n) space, it is worse than the first approach because in many languages (such as Python), stack frames are large, and there's a maximum runtime stack depth of 1000 (you can increase it, but you risk causing memory errors with the underlying interpreter). With <em>every</em> node creating a stack frame, this will greatly limit the maximum Linked List size the algorithm can handle.</p>\n<br/>\n<hr/>\n<h3><a href=\"#approach-3-reverse-second-half-in-place\"><svg><path></path></svg></a>Approach 3: Reverse Second Half In-place</h3>\n<p><strong>Intuition</strong></p>\n<p>The <em><strong>only</strong></em> way we can avoid using O(n) extra space is by modifying the input in-place.</p>\n<p>The strategy we can use is to reverse the second half of the Linked List in-place (modifying the Linked List structure), and then comparing it with the first half. Afterwards, we should re-reverse the second half and put the list back together. While you don't need to restore the list to pass the test cases, it is still good programming practice because the function could be a part of a bigger program that doesn't want the Linked List broken.</p>\n<p><strong>Algorithm</strong></p>\n<p>Specifically, the steps we need to do are:</p>\n<ol>\n<li>Find the end of the first half.</li>\n<li>Reverse the second half.</li>\n<li>Determine whether or not there is a palindrome.</li>\n<li>Restore the list.</li>\n<li>Return the result.</li>\n</ol>\n<p>To do <em>step 1</em>, we could count the number of nodes, calculate how many nodes are in the first half, and then iterate back down the list to find the end of the first half. Or, we could do it in a single parse using the <strong>two runners pointer technique</strong>. Either is acceptable, however we'll have a look at the two runners pointer technique here.</p>\n<p>Imagine we have 2 runners one fast and one slow, running down the nodes of the Linked List. In each second, the fast runner moves down 2 nodes, and the slow runner just 1 node. By the time the fast runner gets to the end of the list, the slow runner will be half way. By representing the runners as pointers, and moving them down the list at the corresponding speeds, we can use this trick to find the middle of the list, and then split the list into two halves.</p>\n<p>If there is an odd-number of nodes, then the \"middle\" node should remain attached to the first half.</p>\n<p><em>Step 2</em> uses the algorithm that can be found in the solution article for the <a href=\"https://leetcode.com/problems/reverse-linked-list/\">Reverse Linked List</a> problem to reverse the second half of the list.</p>\n<p><em>Step 3</em> is fairly straightforward. Remember that we have the first half, which might also contain a \"middle\" node at the end, and the second half, which is reversed. We can step down the lists simultaneously ensuring the node values are equal. When the node we're up to in the second list is <code>null</code>, we know we're done. If there was a middle value attached to the end of the first list, it is correctly ignored by the algorithm. The result should be saved, but not returned, as we still need to restore the list.</p>\n<p><em>Step 4</em> requires using the same function you used for step 2, and then for <em>step 5</em> the saved result should be returned.</p>\n<pre><code>class Solution {\n​\n    public boolean isPalindrome(ListNode head) {\n​\n        if (head == null) return true;\n​\n        // Find the end of first half and reverse second half.\n        ListNode firstHalfEnd = endOfFirstHalf(head);\n        ListNode secondHalfStart = reverseList(firstHalfEnd.next);\n​\n        // Check whether or not there is a palindrome.\n        ListNode p1 = head;\n        ListNode p2 = secondHalfStart;\n        boolean result = true;\n        while (result &amp;&amp; p2 != null) {\n            if (p1.val != p2.val) result = false;\n            p1 = p1.next;\n            p2 = p2.next;\n        }        \n​\n        // Restore the list and return the result.\n        firstHalfEnd.next = reverseList(secondHalfStart);\n        return result;\n    }\n​\n    // Taken from https://leetcode.com/problems/reverse-linked-list/solution/\n    private ListNode reverseList(ListNode head) {\n        ListNode prev = null;\n        ListNode curr = head;\n        while (curr != null) {\n            ListNode nextTemp = curr.next;\n            curr.next = prev;\n            prev = curr;\n            curr = nextTemp;\n        }\n        return prev;\n    }\n​\n    private ListNode endOfFirstHalf(ListNode head) {\n        ListNode fast = head;\n        ListNode slow = head;\n        while (fast.next != null &amp;&amp; fast.next.next != null) {\n            fast = fast.next.next;\n            slow = slow.next;\n        }\n        return slow;\n    }\n}</code></pre>\n<p><strong>Complexity Analysis</strong></p>\n<ul>\n<li>\n<p>Time complexity : O(n), where n is the number of nodes in the Linked List.</p>\n<p>Similar to the above approaches. Finding the middle is O(n), reversing a list in place is O(n), and then comparing the 2 resulting Linked Lists is also O(n).</p>\n</li>\n<li>\n<p>Space complexity : O(1).</p>\n<p>We are changing the next pointers for half of the nodes. This was all memory that had already been allocated, so we are not using any extra memory and therefore it is O(1).</p>\n<p>I have seen some people on the discussion forum saying it has to be O(n) because we're creating a new list. This is incorrect, because we are changing each of the pointers one-by-one, in-place. We are not needing to allocate more than O(1) extra memory to do this work, and there is O(1) stack frames going on the stack. It is the same as reversing the values in an Array in place (using the two-pointer technique).</p>\n</li>\n</ul>\n<p>The downside of this approach is that in a concurrent environment (multiple threads and processes accessing the same data), access to the Linked List by other threads or processes would have to be locked while this function is running, because the Linked List is temporarily broken. This is a limitation of many in-place algorithms though.</p>",
        "isOfficial": true,
        "scrapedAt": "2026-02-18T08:04:49.062Z"
    }
}