{
    "questionId": "253",
    "questionFrontendId": "253",
    "title": "Meeting Rooms II",
    "titleSlug": "meeting-rooms-ii",
    "content": "<p>Given an array of meeting time intervals <code>intervals</code> where <code>intervals[i] = [start<sub>i</sub>, end<sub>i</sub>]</code>, return <em>the minimum number of conference rooms required</em>.</p>\n\n<p>&nbsp;</p>\n<p><strong class=\"example\">Example 1:</strong></p>\n<pre><strong>Input:</strong> intervals = [[0,30],[5,10],[15,20]]\n<strong>Output:</strong> 2\n</pre><p><strong class=\"example\">Example 2:</strong></p>\n<pre><strong>Input:</strong> intervals = [[7,10],[2,4]]\n<strong>Output:</strong> 1\n</pre>\n<p>&nbsp;</p>\n<p><strong>Constraints:</strong></p>\n\n<ul>\n\t<li><code>1 &lt;=&nbsp;intervals.length &lt;= 10<sup>4</sup></code></li>\n\t<li><code>0 &lt;= start<sub>i</sub> &lt; end<sub>i</sub> &lt;= 10<sup>6</sup></code></li>\n</ul>\n",
    "difficulty": "Medium",
    "stats": "{\"totalAccepted\": \"1.1M\", \"totalSubmission\": \"2.2M\", \"totalAcceptedRaw\": 1145887, \"totalSubmissionRaw\": 2181537, \"acRate\": \"52.5%\"}",
    "hints": [
        "Think about how we would approach this problem in a very simplistic way. We will allocate rooms to meetings that occur earlier in the day v/s the ones that occur later on, right?",
        "If you've figured out that we have to <b>sort</b> the meetings by their start time, the next thing to think about is how do we do the allocation? <br>There are two scenarios possible here for any meeting. Either there is no meeting room available and a new one has to be allocated, or a meeting room has freed up and this meeting can take place there.",
        "An important thing to note is that we don't really care <b>which</b> room gets freed up while allocating a room for the current meeting. As long as a room is free, our job is done. <br><br>We already know the rooms we have allocated till now and we also know when are they due to get free because of the end times of the meetings going on in those rooms. We can simply check the room which is due to get vacated the earliest amongst all the allocated rooms.",
        "Following up on the previous hint, we can make use of a min-heap to store the end times of the meetings in various rooms. <br><br>So, every time we want to check if any room is free or not, simply check the topmost element of the min heap as that would be the room that would get free the earliest out of all the other rooms currently occupied.\r\n\r\n<br><br>If the room we extracted from the top of the min heap isn't free, then no other room is. So, we can save time here and simply allocate a new room."
    ],
    "similarQuestions": "[{\"title\": \"Merge Intervals\", \"titleSlug\": \"merge-intervals\", \"difficulty\": \"Medium\", \"translatedTitle\": null}, {\"title\": \"Meeting Rooms\", \"titleSlug\": \"meeting-rooms\", \"difficulty\": \"Easy\", \"translatedTitle\": null}, {\"title\": \"Minimum Number of Arrows to Burst Balloons\", \"titleSlug\": \"minimum-number-of-arrows-to-burst-balloons\", \"difficulty\": \"Medium\", \"translatedTitle\": null}, {\"title\": \"Car Pooling\", \"titleSlug\": \"car-pooling\", \"difficulty\": \"Medium\", \"translatedTitle\": null}, {\"title\": \"Number of Flowers in Full Bloom\", \"titleSlug\": \"number-of-flowers-in-full-bloom\", \"difficulty\": \"Hard\", \"translatedTitle\": null}, {\"title\": \"Meeting Rooms III\", \"titleSlug\": \"meeting-rooms-iii\", \"difficulty\": \"Hard\", \"translatedTitle\": null}, {\"title\": \"Total Cost to Hire K Workers\", \"titleSlug\": \"total-cost-to-hire-k-workers\", \"difficulty\": \"Medium\", \"translatedTitle\": null}, {\"title\": \"Points That Intersect With Cars\", \"titleSlug\": \"points-that-intersect-with-cars\", \"difficulty\": \"Easy\", \"translatedTitle\": null}]",
    "topicTags": [
        {
            "name": "Array",
            "slug": "array"
        },
        {
            "name": "Two Pointers",
            "slug": "two-pointers"
        },
        {
            "name": "Greedy",
            "slug": "greedy"
        },
        {
            "name": "Sorting",
            "slug": "sorting"
        },
        {
            "name": "Heap (Priority Queue)",
            "slug": "heap-priority-queue"
        },
        {
            "name": "Prefix Sum",
            "slug": "prefix-sum"
        }
    ],
    "companyTags": null,
    "codeSnippets": [
        {
            "lang": "C++",
            "langSlug": "cpp",
            "code": "class Solution {\npublic:\n    int minMeetingRooms(vector<vector<int>>& intervals) {\n        \n    }\n};"
        },
        {
            "lang": "Java",
            "langSlug": "java",
            "code": "class Solution {\n    public int minMeetingRooms(int[][] intervals) {\n        \n    }\n}"
        },
        {
            "lang": "Python3",
            "langSlug": "python3",
            "code": "class Solution:\n    def minMeetingRooms(self, intervals: List[List[int]]) -> int:\n        "
        },
        {
            "lang": "Python",
            "langSlug": "python",
            "code": "class Solution(object):\n    def minMeetingRooms(self, intervals):\n        \"\"\"\n        :type intervals: List[List[int]]\n        :rtype: int\n        \"\"\"\n        "
        },
        {
            "lang": "JavaScript",
            "langSlug": "javascript",
            "code": "/**\n * @param {number[][]} intervals\n * @return {number}\n */\nvar minMeetingRooms = function(intervals) {\n    \n};"
        },
        {
            "lang": "TypeScript",
            "langSlug": "typescript",
            "code": "function minMeetingRooms(intervals: number[][]): number {\n    \n};"
        },
        {
            "lang": "C#",
            "langSlug": "csharp",
            "code": "public class Solution {\n    public int MinMeetingRooms(int[][] intervals) {\n        \n    }\n}"
        },
        {
            "lang": "C",
            "langSlug": "c",
            "code": "int minMeetingRooms(int** intervals, int intervalsSize, int* intervalsColSize) {\n    \n}"
        },
        {
            "lang": "Go",
            "langSlug": "golang",
            "code": "func minMeetingRooms(intervals [][]int) int {\n    \n}"
        },
        {
            "lang": "Kotlin",
            "langSlug": "kotlin",
            "code": "class Solution {\n    fun minMeetingRooms(intervals: Array<IntArray>): Int {\n        \n    }\n}"
        },
        {
            "lang": "Swift",
            "langSlug": "swift",
            "code": "class Solution {\n    func minMeetingRooms(_ intervals: [[Int]]) -> Int {\n        \n    }\n}"
        },
        {
            "lang": "Rust",
            "langSlug": "rust",
            "code": "impl Solution {\n    pub fn min_meeting_rooms(intervals: Vec<Vec<i32>>) -> i32 {\n        \n    }\n}"
        },
        {
            "lang": "Ruby",
            "langSlug": "ruby",
            "code": "# @param {Integer[][]} intervals\n# @return {Integer}\ndef min_meeting_rooms(intervals)\n    \nend"
        },
        {
            "lang": "PHP",
            "langSlug": "php",
            "code": "class Solution {\n\n    /**\n     * @param Integer[][] $intervals\n     * @return Integer\n     */\n    function minMeetingRooms($intervals) {\n        \n    }\n}"
        },
        {
            "lang": "Dart",
            "langSlug": "dart",
            "code": "class Solution {\n  int minMeetingRooms(List<List<int>> intervals) {\n    \n  }\n}"
        },
        {
            "lang": "Scala",
            "langSlug": "scala",
            "code": "object Solution {\n    def minMeetingRooms(intervals: Array[Array[Int]]): Int = {\n        \n    }\n}"
        },
        {
            "lang": "Elixir",
            "langSlug": "elixir",
            "code": "defmodule Solution do\n  @spec min_meeting_rooms(intervals :: [[integer]]) :: integer\n  def min_meeting_rooms(intervals) do\n    \n  end\nend"
        },
        {
            "lang": "Erlang",
            "langSlug": "erlang",
            "code": "-spec min_meeting_rooms(Intervals :: [[integer()]]) -> integer().\nmin_meeting_rooms(Intervals) ->\n  ."
        },
        {
            "lang": "Racket",
            "langSlug": "racket",
            "code": "(define/contract (min-meeting-rooms intervals)\n  (-> (listof (listof exact-integer?)) exact-integer?)\n  )"
        }
    ],
    "solution": {
        "content": "<h2><a href=\"#solution-article\"><svg><path></path></svg></a>Solution Article</h2>\n<hr/>\n<br/>\n<p><strong>Intuition</strong></p>\n<p>This problem is very similar to something that employees of a company can face potentially on daily basis.</p>\n<p>Suppose you work at a company and you belong to the IT department and one of your job responsibilities is securing rooms for meetings that are to happen throughout the day in the office.</p>\n<p>You have multiple meeting rooms in the office and you want to make judicious use of them. You don't really want to keep people waiting and want to give a group of employees a room to hold the meeting right on time.</p>\n<p>At the same time, you don't really want to use too many rooms unless absolutely necessary. It would make sense to hold meetings in different rooms provided that the meetings are colliding with each other, otherwise you want to make use of as less rooms as possible to hold all of the meetings. How do you go about it ?</p>\n<p>I just represented a common scenario at an office where given the start and end times for meetings to happen throughout the day, you, as an IT guru need to setup and allocate the room numbers to different teams.</p>\n<p>Let's approach this problem from the perspective of a group of people who want to hold a meeting and have not been allocated a room yet. What would they do?</p>\n<blockquote>\n<p>This group would essentially go from one room to another and check if any meeting room is free. If they find a room that is indeed free, they would start their meeting in that room. Otherwise, they would wait for a room to be free. As soon as the room frees up, they would occupy it.</p>\n</blockquote>\n<p>This is the basic approach that we will follow in this question. So, it is a kind of simulation but not exactly. In the worst case we can assign a new room to all of the meetings but that is not really optimal right? Unless of course they all collide with each other.</p>\n<blockquote>\n<p>We need to be able to find out efficiently if a room is available or not for the current meeting and assign a new room only if none of the assigned rooms is currently free.</p>\n</blockquote>\n<p>Let's look at the first approach based on the idea we just discussed.<br/>\n<br/><br/>\n<br/></p>\n<hr/>\n<h3><a href=\"#approach-1-priority-queues\"><svg><path></path></svg></a>Approach 1: Priority Queues</h3>\n<p>We can't really process the given meetings in any random order. The most basic way of processing the meetings is in increasing order of their <code>start times</code> and this is the order we will follow. After all, it makes sense to allocate a room to the meeting that is scheduled for 9 a.m. in the morning before you worry about the 5 p.m. meeting, right?</p>\n<p>Let's do a dry run of an example problem with sample meeting times and see what our algorithm should be able to do efficiently.</p>\n<p>We will consider the following meeting times for our example <code>(1, 10), (2, 7), (3, 19), (8, 12), (10, 20), (11, 30)</code>. The first part of the tuple is the start time for the meeting and the second value represents the ending time. We are considering the meetings in a sorted order of their start times. The first diagram depicts the first three meetings where each of them requires a new room because of collisions.</p>\n<p>The next 3 meetings start to occupy some of the existing rooms. However, the last one requires a new room altogether and overall we have to use 4 different rooms to accommodate all the meetings.</p>\n<p>Sorting part is easy, but for every meeting how do we find out efficiently if a room is available or not? At any point in time we have multiple rooms that can be occupied and we don't really care which room is free as long as we find one when required for a new meeting.</p>\n<p>A naive way to check if a room is available or not is to iterate on all the rooms and see if one is available when we have a new meeting at hand.</p>\n<blockquote>\n<p>However, we can do better than this by making use of Priority Queues or the Min-Heap data structure.</p>\n</blockquote>\n<p>Instead of manually iterating on every room that's been allocated and checking if the room is available or not, we can keep all the rooms in a min heap where the key for the min heap would be the ending time of meeting.</p>\n<p>So, every time we want to check if <strong>any</strong> room is free or not, simply check the topmost element of the min heap as that would be the room that would get free the earliest out of all the other rooms currently occupied.</p>\n<p>If the room we extracted from the top of the min heap isn't free, then <code>no other room is</code>. So, we can save time here and simply allocate a new room.</p>\n<p>Let us look at the algorithm before moving onto the implementation.</p>\n<p><strong>Algorithm</strong></p>\n<ol>\n<li>Sort the given meetings by their <code>start time</code>.</li>\n<li>Initialize a new <code>min-heap</code> and add the first meeting's ending time to the heap. We simply need to keep track of the ending times as that tells us when a meeting room will get free.</li>\n<li>For every meeting room check if the minimum element of the heap i.e. the room at the top of the heap is free or not.</li>\n<li>If the room is free, then we extract the topmost element and add it back with the ending time of the current meeting we are processing.</li>\n<li>If not, then we allocate a new room and add it to the heap.</li>\n<li>After processing all the meetings, the size of the heap will tell us the number of rooms allocated. This will be the minimum number of rooms needed to accommodate all the meetings.</li>\n</ol>\n<p>Let us now look at the implementation for this algorithm.</p>\n<pre><code>class Solution {\n    public int minMeetingRooms(int[][] intervals) {\n        \n    // Check for the base case. If there are no intervals, return 0\n    if (intervals.length == 0) {\n      return 0;\n    }\n​\n    // Min heap\n    PriorityQueue&lt;Integer&gt; allocator =\n        new PriorityQueue&lt;Integer&gt;(\n            intervals.length,\n            new Comparator&lt;Integer&gt;() {\n              public int compare(Integer a, Integer b) {\n                return a - b;\n              }\n            });\n​\n    // Sort the intervals by start time\n    Arrays.sort(\n        intervals,\n        new Comparator&lt;int[]&gt;() {\n          public int compare(final int[] a, final int[] b) {\n            return a[0] - b[0];\n          }\n        });\n​\n    // Add the first meeting\n    allocator.add(intervals[0][1]);\n​\n    // Iterate over remaining intervals\n    for (int i = 1; i &lt; intervals.length; i++) {\n​\n      // If the room due to free up the earliest is free, assign that room to this meeting.\n      if (intervals[i][0] &gt;= allocator.peek()) {\n        allocator.poll();\n      }\n​\n      // If a new room is to be assigned, then also we add to the heap,\n      // If an old room is allocated, then also we have to add to the heap with updated end time.\n      allocator.add(intervals[i][1]);\n    }\n​\n    // The size of the heap tells us the minimum rooms required for all the meetings.\n    return allocator.size();\n  }\n}</code></pre>\n<p><strong>Complexity Analysis</strong></p>\n<ul>\n<li>\n<p>Time Complexity: O(NlogN).</p>\n<ul>\n<li>There are two major portions that take up time here. One is <code>sorting</code> of the array that takes O(NlogN) considering that the array consists of N elements.</li>\n<li>Then we have the <code>min-heap</code>. In the worst case, all N meetings will collide with each other. In any case we have N add operations on the heap. In the worst case we will have N extract-min operations as well. Overall complexity being (NlogN) since extract-min operation on a heap takes O(logN).</li>\n</ul>\n</li>\n<li>\n<p>Space Complexity: O(N) because we construct the <code>min-heap</code> and that can contain N elements in the worst case as described above in the time complexity section. Hence, the space complexity is O(N).</p>\n<br/>\n</li>\n</ul>\n<br/>\n<hr/>\n<h3><a href=\"#approach-2-chronological-ordering\"><svg><path></path></svg></a>Approach 2: Chronological Ordering</h3>\n<p><strong>Intuition</strong></p>\n<p>The meeting timings given to us define a chronological order of events throughout the day. We are given the start and end timings for the meetings which can help us define this ordering.</p>\n<p>Arranging the meetings according to their start times helps us know the natural order of meetings throughout the day. However, simply knowing when a meeting starts doesn't tell us much about its duration.</p>\n<p>We also need the meetings sorted by their ending times because an ending event essentially tells us that there must have been a corresponding starting event and more importantly, an ending event tell us that a previously occupied room has now become free.</p>\n<p>A meeting is defined by its start and end times. However, for this specific algorithm, we need to treat the start and end times <code>individually</code>. This might not make sense right away because a meeting is defined by its start and end times. If we separate the two and treat them individually, then the identity of a meeting goes away. This is fine because:</p>\n<blockquote>\n<p>When we encounter an ending event, that means that some meeting that started earlier has ended now. We are not really concerned with which meeting has ended. All we need is that <strong>some</strong> meeting ended thus making a room available.</p>\n</blockquote>\n<p>Let us consider the same example as we did in the last approach. We have the following meetings to be scheduled: <code>(1, 10), (2, 7), (3, 19), (8, 12), (10, 20), (11, 30)</code>. As before, the first diagram show us that the first three meetings are colliding with each other and they have to be allocated separate rooms.</p>\n<p>The next two diagrams process the remaining meetings and we see that we can now reuse some of the existing meeting rooms. The final result is the same, we need 4 different meeting rooms to process all the meetings. That's the best we can do here.</p>\n<p><strong>Algorithm</strong></p>\n<ol>\n<li>Separate out the start times and the end times in their separate arrays.</li>\n<li>Sort the start times and the end times separately. Note that this will mess up the original correspondence of start times and end times. They will be treated individually now.</li>\n<li>We consider two pointers: <code>s_ptr</code> and <code>e_ptr</code> which refer to start pointer and end pointer. The start pointer simply iterates over all the meetings and the end pointer helps us track if a meeting has ended and if we can reuse a room.</li>\n<li>When considering a specific meeting pointed to by <code>s_ptr</code>, we check if this start timing is greater than the meeting pointed to by <code>e_ptr</code>. If this is the case then that would mean some meeting has ended by the time the meeting at <code>s_ptr</code> had to start. So we can reuse one of the rooms. Otherwise, we have to allocate a new room.</li>\n<li>If a meeting has indeed ended i.e. if <code>start[s_ptr] &gt;= end[e_ptr]</code>, then we increment <code>e_ptr</code>.</li>\n<li>Repeat this process until <code>s_ptr</code> processes all of the meetings.</li>\n</ol>\n<p>Let us now look at the implementation for this algorithm.</p>\n<pre><code>class Solution {\n    public int minMeetingRooms(int[][] intervals) {\n        \n    // Check for the base case. If there are no intervals, return 0\n    if (intervals.length == 0) {\n      return 0;\n    }\n​\n    Integer[] start = new Integer[intervals.length];\n    Integer[] end = new Integer[intervals.length];\n​\n    for (int i = 0; i &lt; intervals.length; i++) {\n      start[i] = intervals[i][0];\n      end[i] = intervals[i][1];\n    }\n​\n    // Sort the intervals by end time\n    Arrays.sort(\n        end,\n        new Comparator&lt;Integer&gt;() {\n          public int compare(Integer a, Integer b) {\n            return a - b;\n          }\n        });\n​\n    // Sort the intervals by start time\n    Arrays.sort(\n        start,\n        new Comparator&lt;Integer&gt;() {\n          public int compare(Integer a, Integer b) {\n            return a - b;\n          }\n        });\n​\n    // The two pointers in the algorithm: e_ptr and s_ptr.\n    int startPointer = 0, endPointer = 0;\n​\n    // Variables to keep track of maximum number of rooms used.\n    int usedRooms = 0;\n​\n    // Iterate over intervals.\n    while (startPointer &lt; intervals.length) {\n​\n      // If there is a meeting that has ended by the time the meeting at `start_pointer` starts\n      if (start[startPointer] &gt;= end[endPointer]) {\n        usedRooms -= 1;\n        endPointer += 1;\n      }\n​\n      // We do this irrespective of whether a room frees up or not.\n      // If a room got free, then this used_rooms += 1 wouldn't have any effect. used_rooms would\n      // remain the same in that case. If no room was free, then this would increase used_rooms\n      usedRooms += 1;\n      startPointer += 1;\n​\n    }\n​\n    return usedRooms;\n  }\n}</code></pre>\n<p><strong>Complexity Analysis</strong></p>\n<ul>\n<li>\n<p>Time Complexity: O(NlogN) because all we are doing is sorting the two arrays for <code>start timings</code> and <code>end timings</code> individually and each of them would contain N elements considering there are N intervals.</p>\n</li>\n<li>\n<p>Space Complexity: O(N) because we create two separate arrays of size N, one for recording the start times and one for the end times.</p>\n</li>\n</ul>\n<br/>\n<br/>",
        "isOfficial": true,
        "scrapedAt": "2026-02-18T07:25:54.627Z"
    }
}