{"id":"109","title":"Convert Sorted List to Binary Search Tree","difficulty":"Medium","content":"<p>Given the <code>head</code> of a singly linked list where elements are sorted in <strong>ascending order</strong>, convert <em>it to a </em><span data-keyword=\"height-balanced\"><strong><em>height-balanced</em></strong></span> <em>binary search tree</em>.</p>\n\n<p>&nbsp;</p>\n<p><strong class=\"example\">Example 1:</strong></p>\n<img alt=\"\" src=\"https://assets.leetcode.com/uploads/2020/08/17/linked.jpg\" style=\"width: 500px; height: 388px;\" />\n<pre>\n<strong>Input:</strong> head = [-10,-3,0,5,9]\n<strong>Output:</strong> [0,-3,9,-10,null,5]\n<strong>Explanation:</strong> One possible answer is [0,-3,9,-10,null,5], which represents the shown height balanced BST.\n</pre>\n\n<p><strong class=\"example\">Example 2:</strong></p>\n\n<pre>\n<strong>Input:</strong> head = []\n<strong>Output:</strong> []\n</pre>\n\n<p>&nbsp;</p>\n<p><strong>Constraints:</strong></p>\n\n<ul>\n\t<li>The number of nodes in <code>head</code> is in the range <code>[0, 2 * 10<sup>4</sup>]</code>.</li>\n\t<li><code>-10<sup>5</sup> &lt;= Node.val &lt;= 10<sup>5</sup></code></li>\n</ul>\n","tags":["Linked List","Divide and Conquer","Tree","Binary Search Tree","Binary Tree"],"java_snippet":"/**\n * Definition for singly-linked list.\n * public class ListNode {\n *     int val;\n *     ListNode next;\n *     ListNode() {}\n *     ListNode(int val) { this.val = val; }\n *     ListNode(int val, ListNode next) { this.val = val; this.next = next; }\n * }\n */\n/**\n * Definition for a binary tree node.\n * public class TreeNode {\n *     int val;\n *     TreeNode left;\n *     TreeNode right;\n *     TreeNode() {}\n *     TreeNode(int val) { this.val = val; }\n *     TreeNode(int val, TreeNode left, TreeNode right) {\n *         this.val = val;\n *         this.left = left;\n *         this.right = right;\n *     }\n * }\n */\nclass Solution {\n    public TreeNode sortedListToBST(ListNode head) {\n        \n    }\n}","solution":"<h2><a href=\"#solution\"><svg><path></path></svg></a>Solution</h2>\n<hr/>\n<h3><a href=\"#approach-1-recursion\"><svg><path></path></svg></a>Approach 1: Recursion</h3>\n<p><strong>Intuition</strong></p>\n<p>The important condition that we have to adhere to in this problem is that we have to create a <code>height balanced</code> binary search tree using the set of nodes given to us in the form of a linked list. The good thing is that the nodes in the linked list are sorted in ascending order.</p>\n<p>As we know, a binary search tree is essentially a rooted binary tree with a very special property or relationship amongst its nodes. For a given node of the binary search tree, its value must be ≥ the value of <code>all</code> the nodes in the left subtree and ≤ the value of <code>all</code> the nodes in the right subtree. Since a binary tree has a recursive substructure, so does a BST i.e. all the subtrees are binary search trees in themselves.</p>\n<p>The main idea in this approach and the next is that:</p>\n<blockquote>\n<p>the middle element of the given list would form the root of the binary search tree. All the elements to the left of the middle element would form the left subtree recursively. Similarly, all the elements to the right of the middle element will form the right subtree of the binary search tree. This would ensure the height balance required in the resulting binary search tree.</p>\n</blockquote>\n<p><strong>Algorithm</strong></p>\n<ol>\n<li>Since we are given a linked list and not an array, we don't really have access to the elements of the list using indexes. We want to know the middle element of the linked list.</li>\n<li>We can use the two pointer approach for finding out the middle element of a linked list. Essentially, we have two pointers called <code>slow_ptr</code> and <code>fast_ptr</code>. The <code>slow_ptr</code> moves one node at a time whereas the <code>fast_ptr</code> moves two nodes at a time. By the time the <code>fast_ptr</code> reaches the end of the linked list, the <code>slow_ptr</code> would have reached the middle element of the linked list. For an even sized list, any of the two middle elements can act as the root of the BST.</li>\n<li>Once we have the middle element of the linked list, we disconnect the portion of the list to the left of the middle element. The way we do this is by keeping a <code>prev_ptr</code> as well which points to one node before the <code>slow_ptr</code> i.e. <code>prev_ptr.next</code> = <code>slow_ptr</code>. For disconnecting the left portion we simply do <code>prev_ptr.next = null</code></li>\n<li>We only need to pass the head of the linked list to the function that converts it to a height balances BST. So, we recurse on the left half of the linked list by passing the original head of the list and on the right half by passing <code>slow_ptr.next</code> as the head.</li>\n</ol>\n<p>Let's look at this algorithm in action on a sample linked list.</p>\n \n\n<pre><code>/*\n * Definition for singly-linked list.\n * class ListNode {\n *     int val;\n *     ListNode next;\n *     ListNode() {}\n *     ListNode(int val) { this.val = val; }\n *     ListNode(int val, ListNode next) {\n *         this.val = val;\n *         this.next = next;\n *     }\n * }\n *\n * Definition for a binary tree node.\n * class TreeNode {\n *     int val;\n *     TreeNode left;\n *     TreeNode right;\n *     TreeNode() {}\n *     TreeNode(int val) { this.val = val; }\n *     TreeNode(int val, TreeNode left, TreeNode right) {\n *         this.val = val;\n *         this.left = left;\n *         this.right = right;\n *     }\n * }\n */\nclass Solution {\n    private ListNode findMiddleElement(ListNode head) {\n        // The pointer used to disconnect the left half from the mid node.\n        ListNode prevPtr = null;\n        ListNode slowPtr = head;\n        ListNode fastPtr = head;\n\n        // Iterate until fastPtr reaches the end of the linked list.\n        while (fastPtr != null &amp;&amp; fastPtr.next != null) {\n            prevPtr = slowPtr;\n            slowPtr = slowPtr.next;\n            fastPtr = fastPtr.next.next;\n        }\n\n        // Handling the case when slowPtr was equal to head.\n        if (prevPtr != null) {\n            prevPtr.next = null;\n        }\n        return slowPtr;\n    }\n\n    public TreeNode sortedListToBST(ListNode head) {\n        // If the head doesn't exist, then the linked list is empty\n        if (head == null) {\n            return null;\n        }\n\n        // Find the middle element for the list.\n        ListNode mid = findMiddleElement(head);\n\n        // The mid becomes the root of the BST.\n        TreeNode node = new TreeNode(mid.val);\n\n        // Base case when there is just one element in the linked list\n        if (head == mid) {\n            return node;\n        }\n\n        // Recursively form balanced BSTs using the left and right halves\n        node.left = sortedListToBST(head);\n        node.right = sortedListToBST(mid.next);\n\n        return node;\n    }\n}</code></pre>\n<p><strong>Complexity Analysis</strong></p>\n<ul>\n<li>\n<p>Time Complexity: O(NlogN). Suppose our linked list consists of N elements. For every list we pass to our recursive function, we have to calculate the middle element for that list. For a list of size N, it takes N/2 steps to find the middle element i.e. O(N) to find the mid. We do this for <strong>every</strong> half of the original linked list. From the looks of it, this seems to be an O(N2) algorithm. However, on closer analysis, it turns out to be a bit more efficient than O(N2).</p>\n<p>Let's look at the number of operations that we have to perform on each of the halves of the linked list. As we mentioned earlier, it takes N/2 steps to find the middle of a linked list with N elements. After finding the middle element, we are left with two halves of size N/2 each. Then, we find the middle element for <code>both</code> of these halves and it would take a total of 2×N/4 steps for that. And similarly for the smaller sublists that keep forming recursively. This would give us the following series of operations for a list of size N.</p>\n2N​+2⋅4N​+4⋅8N​+8⋅16N​…​\n<p>Essentially, this is done logN times since we split the linked list in half every time. Hence, the above equation becomes:</p>\n===​i=1∑logN​2i−1⋅2iN​i=1∑logN​2N​2N​logNO(NlogN)​\n</li>\n<li>\n<p>Space Complexity: O(logN). Since we are resorting to recursion, there is always the added space complexity of the recursion stack that comes into picture. This could have been O(N) for a skewed tree, but the question clearly states that we need to maintain the height balanced property. This ensures the height of the tree to be bounded by O(logN). Hence, the space complexity is O(logN).</p>\n</li>\n</ul>\n<p>The main problem with the above solution seems to be the middle element computation. That takes up a lot of unnecessary time and this is due to the nature of the linked list data structure. Let's look at the next solution which tries to overcome this.<br/>\n<br/><br/>\n<br/></p>\n<hr/>\n<h3><a href=\"#approach-2-recursion--conversion-to-array\"><svg><path></path></svg></a>Approach 2: Recursion + Conversion to Array</h3>\n<p>This approach is a classic example of the time-space tradeoff.</p>\n<blockquote>\n<p>You can get the time complexity down by using more space.</p>\n</blockquote>\n<p>That's exactly what we're going to do in this approach. Essentially, we will convert the given linked list into an array and then use that array to form our binary search tree. In an array fetching the middle element is a O(1) operation and this will bring down the overall time complexity.</p>\n<p><strong>Algorithm</strong></p>\n<ol>\n<li>Convert the given linked list into an array. Let's call the beginning and the end of the array as <code>left</code> and <code>right</code></li>\n<li>Find the middle element as <code>(left + right) / 2</code>. Let's call this element as <code>mid</code>. This is a O(1) time operation and is the only major improvement over the previous algorithm.</li>\n<li>The middle element forms the root of the BST.</li>\n<li>Recursively form binary search trees on the two halves of the array represented by <code>(left, mid - 1)</code> and <code>(mid + 1, right)</code> respectively.</li>\n</ol>\n<p>Let's look at the implementation for this algorithm and then we will get to the complexity analysis.</p>\n<pre><code>import java.util.ArrayList;\nimport java.util.List;\n\nclass Solution {\n    private List&lt;Integer&gt; values = new ArrayList&lt;&gt;();\n\n    private void mapListToValues(ListNode head) {\n        while (head != null) {\n            values.add(head.val);\n            head = head.next;\n        }\n    }\n\n    private TreeNode convertListToBST(int left, int right) {\n        // Invalid case\n        if (left &gt; right) {\n            return null;\n        }\n\n        // Middle element forms the root.\n        int mid = (left + right) / 2;\n        TreeNode node = new TreeNode(values.get(mid));\n\n        // Base case for when there is only one element left in the array\n        if (left == right) {\n            return node;\n        }\n\n        // Recursively form BST on the two halves\n        node.left = convertListToBST(left, mid - 1);\n        node.right = convertListToBST(mid + 1, right);\n\n        return node;\n    }\n\n    public TreeNode sortedListToBST(ListNode head) {\n        // Form an array out of the given linked list and then\n        // use the array to form the BST.\n        mapListToValues(head);\n\n        // Convert the array to BST\n        return convertListToBST(0, values.size() - 1);\n    }\n}</code></pre>\n<p><strong>Complexity Analysis</strong></p>\n<ul>\n<li>Time Complexity: The time complexity comes down to just O(N) now since we convert the linked list to an array initially and then we convert the array into a BST. Accessing the middle element now takes O(1) time and hence the time complexity comes down.</li>\n<li>Space Complexity: Since we used extra space to bring down the time complexity, the space complexity now goes up to O(N) as opposed to just O(logN) in the previous solution. This is due to the array we construct initially.\n<br/>\n</li>\n</ul>\n<br/>\n<hr/>\n<h3><a href=\"#approach-3-inorder-simulation\"><svg><path></path></svg></a>Approach 3: Inorder Simulation</h3>\n<p><strong>Intuition</strong></p>\n<p>As we know, there are three different types of traversals for a binary tree:</p>\n<ul>\n<li>Inorder</li>\n<li>Preorder and</li>\n<li>Postorder traversals.</li>\n</ul>\n<p>The inorder traversal on a binary search tree leads to a very interesting outcome.</p>\n<blockquote>\n<p>Elements processed in the inorder fashion on a binary search tree turn out to be sorted in ascending order.</p>\n</blockquote>\n<p>The approach listed here make use of this idea to formulate the construction of a binary search tree. The reason we are able to use this idea in this problem is because we are given a <code>sorted</code> linked list initially.</p>\n<p>Before looking at the algorithm, let us look at how the inorder traversal actually leads to a sorted order of nodes' values.</p>\n \n\n<p>The critical idea based on the inorder traversal that we will exploit to solve this problem, is:</p>\n<blockquote>\n<p>We know that the leftmost element in the inorder traversal has to be the head of our given linked list. Similarly, the next element in the inorder traversal will be the second element in the linked list and so on. This is made possible because the initial list given to us is sorted in ascending order.</p>\n</blockquote>\n<p>Now that we have an idea about the relationship between the inorder traversal of a binary search tree and the numbers being sorted in ascending order, let's get to the algorithm.</p>\n<p><strong>Algorithm</strong></p>\n<p>Let's quickly look at a pseudo-code to make the algorithm simple to understand.</p>\n<pre>➔ function formBst(start, end)\n➔      mid = (start + end) / 2\n➔      formBst(start, mid - 1)\n➔\n➔      TreeNode(head.val)\n➔      head = head.next\n➔       \n➔      formBst(mid + 1, end)\n➔\n</pre>\n<ol>\n<li>Iterate over the linked list to find out its length. We will make use of two different pointer variables here to mark the beginning and the end of the list. Let's call them <code>start</code> and <code>end</code> with their initial values being <code>0</code> and <code>length - 1</code> respectively.</li>\n<li>Remember, we have to simulate the inorder traversal here. We can find out the middle element by using <code>(start + end) / 2</code>. Note that we don't really find out the middle node of the linked list. We just have a variable telling us the index of the middle element. We simply need this to make recursive calls on the two halves.</li>\n<li>Recurse on the left half by using <code>start, mid - 1</code> as the starting and ending points.</li>\n<li>The invariance that we maintain in this algorithm is that whenever we are done building the left half of the BST, the head pointer in the linked list will point to the root node or the middle node (which becomes the root). So, we simply use the current value pointed to by <code>head</code> as the root node and progress the head node by once i.e. <code>head = head.next</code></li>\n<li>We recurse on the right hand side using <code>mid + 1, end</code> as the starting and ending points.</li>\n</ol>\n<p>Let's look at an animation to make things even clearer.</p>\n \n\n<pre><code>class Solution {\n    private ListNode head;\n\n    private int findSize(ListNode head) {\n        ListNode ptr = head;\n        int count = 0;\n        while (ptr != null) {\n            ptr = ptr.next;\n            count++;\n        }\n        return count;\n    }\n\n    private TreeNode convertListToBST(int left, int right) {\n        // Invalid case\n        if (left &gt; right) {\n            return null;\n        }\n\n        int mid = (left + right) / 2;\n\n        // First step of simulated inorder traversal: left subtree\n        TreeNode leftChild = convertListToBST(left, mid - 1);\n\n        // Process current node\n        TreeNode node = new TreeNode(head.val);\n        node.left = leftChild;\n\n        // Move head to the next list node\n        head = head.next;\n\n        // Build right subtree\n        node.right = convertListToBST(mid + 1, right);\n\n        return node;\n    }\n\n    public TreeNode sortedListToBST(ListNode head) {\n        int size = findSize(head);\n        this.head = head;\n        return convertListToBST(0, size - 1);\n    }\n}</code></pre>\n<p><strong>Complexity Analysis</strong></p>\n<ul>\n<li>Time Complexity: The time complexity is still O(N) since we still have to process each of the nodes in the linked list once and form corresponding BST nodes.</li>\n<li>Space Complexity: O(logN) since now the only extra space is used by the recursion stack and since we are building a height balanced BST, the height is bounded by logN.</li>\n</ul>\n<p><br/><br/></p>"}