{"id":"116","title":"Populating Next Right Pointers in Each Node","difficulty":"Medium","content":"<p>You are given a <strong>perfect binary tree</strong> where all leaves are on the same level, and every parent has two children. The binary tree has the following definition:</p>\n\n<pre>\nstruct Node {\n  int val;\n  Node *left;\n  Node *right;\n  Node *next;\n}\n</pre>\n\n<p>Populate each next pointer to point to its next right node. If there is no next right node, the next pointer should be set to <code>NULL</code>.</p>\n\n<p>Initially, all next pointers are set to <code>NULL</code>.</p>\n\n<p>&nbsp;</p>\n<p><strong class=\"example\">Example 1:</strong></p>\n<img alt=\"\" src=\"https://assets.leetcode.com/uploads/2019/02/14/116_sample.png\" style=\"width: 500px; height: 171px;\" />\n<pre>\n<strong>Input:</strong> root = [1,2,3,4,5,6,7]\n<strong>Output:</strong> [1,#,2,3,#,4,5,6,7,#]\n<strong>Explanation: </strong>Given the above perfect binary tree (Figure A), your function should populate each next pointer to point to its next right node, just like in Figure B. The serialized output is in level order as connected by the next pointers, with &#39;#&#39; signifying the end of each level.\n</pre>\n\n<p><strong class=\"example\">Example 2:</strong></p>\n\n<pre>\n<strong>Input:</strong> root = []\n<strong>Output:</strong> []\n</pre>\n\n<p>&nbsp;</p>\n<p><strong>Constraints:</strong></p>\n\n<ul>\n\t<li>The number of nodes in the tree is in the range <code>[0, 2<sup>12</sup> - 1]</code>.</li>\n\t<li><code>-1000 &lt;= Node.val &lt;= 1000</code></li>\n</ul>\n\n<p>&nbsp;</p>\n<p><strong>Follow-up:</strong></p>\n\n<ul>\n\t<li>You may only use constant extra space.</li>\n\t<li>The recursive approach is fine. You may assume implicit stack space does not count as extra space for this problem.</li>\n</ul>\n","tags":["Linked List","Tree","Depth-First Search","Breadth-First Search","Binary Tree"],"java_snippet":"/*\n// Definition for a Node.\nclass Node {\n    public int val;\n    public Node left;\n    public Node right;\n    public Node next;\n\n    public Node() {}\n    \n    public Node(int _val) {\n        val = _val;\n    }\n\n    public Node(int _val, Node _left, Node _right, Node _next) {\n        val = _val;\n        left = _left;\n        right = _right;\n        next = _next;\n    }\n};\n*/\n\nclass Solution {\n    public Node connect(Node root) {\n        \n    }\n}","solution":"<h2><a href=\"#solution\"><svg><path></path></svg></a>Solution</h2>\n<h3><a href=\"#approach-1-level-order-traversal\"><svg><path></path></svg></a>Approach 1: Level Order Traversal</h3>\n<p><strong>Intuition</strong></p>\n<p>There are two basic kinds of traversals on a tree or a graph. One is where we explore the tree in a depth first manner i.e. one branch at a time. The other one is where we traverse the tree breadth-wise i.e. we explore one level of the tree before moving on to the next one. For trees, we have further classifications of the depth first traversal approach called <code>preorder</code>, <code>inorder</code>, and the <code>postorder</code> traversals. Breadth first approach to exploring a tree is based on the concept of the <code>level</code> of a node. The <code>level</code> of a node is its depth or distance from the root node. We process all the nodes on one level before moving on to the next one.</p>\n<p>Now that we have the basics out of the way, it's pretty evident that the problem statement strongly hints at a breadth first kind of a solution. We need to link all the nodes together which lie on the <code>same level</code> and the level order or the breadth first traversal gives us access to all such nodes.</p>\n<p><strong>Algorithm</strong></p>\n<ol>\n<li>\n<p>Initialize a queue, <code>Q</code> which we will be making use of during our traversal. There are multiple ways to implement the level order traversal especially when it comes to identifying the level of a particular node.</p>\n<ol>\n<li>\n<p>We can add a pair of (node,level) to the queue and whenever we add the children of a node, we add (node.left,parent_level+1) and (node.right,parent_level+1). This approach wouldn't be very efficient for our algorithm since we need <em>all</em> the nodes on the same level and we would need another data structure just for that.</p>\n</li>\n<li>\n<p>A more memory efficient way of segregating the same level nodes is to use some demarcation between the levels. Usually, we insert a <code>null</code> entry in the queue which marks the end of the previous level and the start of the next level. This is a great approach but again, it would still consume some memory proportional to the number of levels in the tree.</p>\n</li>\n<li>\n<p>The approach we will be using here would have a nested loop structure to get around the requirement of a <code>null</code> pointer. Essentially, at each step, we record the size of the queue and that always corresponds to <em><strong>all</strong></em> the nodes on a particular level. Once we have this size, we only process these many elements and no more. By the time we are done processing <code>size</code> number of elements, the queue would contain <em><strong>all</strong></em> the nodes on the next level. Here's a pseudocode for the same:</p>\n\n</li>\n</ol>\n</li>\n<li>\n<p>We start off by adding the root of the tree in the queue. Since there is just one node on the level 0, we don't need to establish any connections and can move onto the <code>while</code> loop.</p>\n</li>\n<li>\n<p>The first <code>while</code> loop from the pseudocode above essentially iterates over each level one by one and the inner for loop iterates over all the nodes on the particular level. Since we have access to all the nodes on the same level, we can establish the next pointers easily.</p>\n</li>\n<li>\n<p>When we <code>poll</code> a node inside the <code>for</code> loop from the pseudocode above, we add its children at the back of the queue. Also, the element at the head of the queue is the <code>next</code> element in order, on the current level. So, we can easily establish the new pointers.</p>\n</li>\n</ol>\n<pre><code>class Solution {\n    public Node connect(Node root) {\n        if (root == null) {\n            return root;\n        }\n\n        // Initialize a queue data structure which contains\n        // just the root of the tree\n        Queue&lt;Node&gt; Q = new LinkedList&lt;&gt;();\n        Q.offer(root);\n\n        // Outer while loop which iterates over each level\n        while (!Q.isEmpty()) {\n            // Note the size of the queue\n            int size = Q.size();\n\n            // Iterate over all the nodes on the current level\n            for (int i = 0; i &lt; size; i++) {\n                // Pop a node from the front of the queue\n                Node node = Q.poll();\n\n                // This check is important. We don't want to\n                // establish any wrong connections. The queue will\n                // contain nodes from 2 levels at most at any\n                // point in time. This check ensures we don't\n                // establish next pointers beyond the end\n                // of a level\n                if (i &lt; size - 1) {\n                    node.next = Q.peek();\n                }\n\n                // Add the children, if any, to the back of\n                // the queue\n                if (node.left != null) {\n                    Q.offer(node.left);\n                }\n                if (node.right != null) {\n                    Q.offer(node.right);\n                }\n            }\n        }\n\n        // Since the tree has now been modified, return the root node\n        return root;\n    }\n}</code></pre>\n<p><strong>Complexity Analysis</strong></p>\n<ul>\n<li>Time Complexity: O(N) since we process each node exactly once. Note that processing a node in this context means polling the node from the queue and then establishing the next pointers.</li>\n<li>Space Complexity: O(N). This is a perfect binary tree which means the last level contains N/2 nodes. The space complexity for breadth first traversal is the space occupied by the queue which is dependent upon the maximum number of nodes in particular level. So, in this case, the space complexity would be O(N).\n<br/>\n</li>\n</ul>\n<br/>\n<hr/>\n<h3><a href=\"#approach-2-using-previously-established-next-pointers\"><svg><path></path></svg></a>Approach 2: Using previously established next pointers</h3>\n<p><strong>Intuition</strong></p>\n<p>Let's look at the two types of <code>next</code> pointer connections we need to establish for a given tree.</p>\n<ol>\n<li>\n<p>This first case is the one where we establish the next pointers between the two children of a given node. This is the easier of the two cases since both the children are accessible via the same node. We can simply do the following to establish this connection.</p>\n\n</li>\n<li>\n<p>This next case is not too straightforward to handle. In addition to establishing the next pointers between the nodes having a common parent, we also need to set-up the correct pointers between nodes which have a different parent.</p>\n</li>\n</ol>\n<p>If we simply had the parent pointers available with each node, this problem would have been trivial to solve. However, we don't have any such pointers available. The basic idea for this approach is based on the fact that:</p>\n<blockquote>\n<p>We only move on to the level N+1 when we are done establishing the next pointers for the level N. Since we have access to all the nodes on a particular level via the next pointers, we can use these next pointers to establish the connections for the next level or the level containing their children.</p>\n</blockquote>\n<p><strong>Algorithm</strong></p>\n<ol>\n<li>\n<p>We start at the root node. Since there are no more nodes to process on the first level or level <code>0</code>, we can establish the next pointers on the next level i.e. level 1. An important thing to remember in this algorithm is that we establish the next pointers for a level N while we are still on level N−1 and once we are done establishing these new connections, we move on to N and do the same thing for N+1.</p>\n</li>\n<li>\n<p>As we just said, when we go over the nodes of a particular level, their next pointers are already established. This is what helps get rid of the queue data structure from the previous approach and helps save space. To start on a particular level, we just need the <code>leftmost</code> node. From there on out, its just a linked list traversal.</p>\n</li>\n<li>\n<p>Based on these ideas, our algorithm will have the following pseudocode:</p>\n\n</li>\n<li>\n<p>The <code>Connection 1</code> and <code>Connection 2</code> mentioned above correspond to the two kinds of connections we looked at earlier on in the intuition section of this approach.</p>\n<ol>\n<li>\n<p>The first one is fairly simple to establish given that it's between the two nodes having a common parent. So, we could simply do something like this to link the two children:</p>\n\n</li>\n<li>\n<p>For the second type of connection, we have to make use of the next pointers on the current level. Remember that this second type of connection is between nodes that have different parents. More specifically, it's the link between the right child of a node and the left child of the <code>next</code> node. Since we already have the next pointers set up on the current level, we use this to set up the correct pointers on the next level.</p>\n\n</li>\n</ol>\n</li>\n<li>\n<p>Once we are done with the current level, we move on to the next one. One last thing that's left here is to update the <code>leftmost</code> node. We need that node to start traversal on a particular level. Think of it as the head of the linked list. Since this is a <code>perfect binary tree</code>, the leftmost node will always be the left child of the current leftmost node. The only nodes which don't have any children are the ones on the final level and these would be the leaves of the tree.</p>\n</li>\n</ol>\n<pre><code>class Solution {\n    public Node connect(Node root) {\n        if (root == null) {\n            return root;\n        }\n\n        // Start with the root node. There are no next pointers\n        // that need to be set up on the first level\n        Node leftmost = root;\n\n        // Once we reach the final level, we are done\n        while (leftmost.left != null) {\n\n            // Iterate the \"linked list\" starting from the head\n            // node and using the next pointers, establish the\n            // corresponding links for the next level\n            Node head = leftmost;\n            while (head != null) {\n\n                // CONNECTION 1\n                head.left.next = head.right;\n\n                // CONNECTION 2\n                if (head.next != null) {\n                    head.right.next = head.next.left;\n                }\n\n                // Progress along the list (nodes on the current level)\n                head = head.next;\n            }\n\n            // Move onto the next level\n            leftmost = leftmost.left;\n        }\n\n        return root;\n    }\n}</code></pre>\n<p><strong>Complexity Analysis</strong></p>\n<ul>\n<li>Time Complexity: O(N) since we process each node exactly once.</li>\n<li>Space Complexity: O(1) since we don't make use of any additional data structure for traversing nodes on a particular level like the previous approach does.\n<br/>\n</li>\n</ul>\n<br/>"}