{"id":"261","title":"Graph Valid Tree","difficulty":"Medium","content":"<p>You have a graph of <code>n</code> nodes labeled from <code>0</code> to <code>n - 1</code>. You are given an integer n and a list of <code>edges</code> where <code>edges[i] = [a<sub>i</sub>, b<sub>i</sub>]</code> indicates that there is an undirected edge between nodes <code>a<sub>i</sub></code> and <code>b<sub>i</sub></code> in the graph.</p>\n\n<p>Return <code>true</code> <em>if the edges of the given graph make up a valid tree, and</em> <code>false</code> <em>otherwise</em>.</p>\n\n<p>&nbsp;</p>\n<p><strong class=\"example\">Example 1:</strong></p>\n<img alt=\"\" src=\"https://assets.leetcode.com/uploads/2021/03/12/tree1-graph.jpg\" style=\"width: 222px; height: 302px;\" />\n<pre>\n<strong>Input:</strong> n = 5, edges = [[0,1],[0,2],[0,3],[1,4]]\n<strong>Output:</strong> true\n</pre>\n\n<p><strong class=\"example\">Example 2:</strong></p>\n<img alt=\"\" src=\"https://assets.leetcode.com/uploads/2021/03/12/tree2-graph.jpg\" style=\"width: 382px; height: 222px;\" />\n<pre>\n<strong>Input:</strong> n = 5, edges = [[0,1],[1,2],[2,3],[1,3],[1,4]]\n<strong>Output:</strong> false\n</pre>\n\n<p>&nbsp;</p>\n<p><strong>Constraints:</strong></p>\n\n<ul>\n\t<li><code>1 &lt;= n &lt;= 2000</code></li>\n\t<li><code>0 &lt;= edges.length &lt;= 5000</code></li>\n\t<li><code>edges[i].length == 2</code></li>\n\t<li><code>0 &lt;= a<sub>i</sub>, b<sub>i</sub> &lt; n</code></li>\n\t<li><code>a<sub>i</sub> != b<sub>i</sub></code></li>\n\t<li>There are no self-loops or repeated edges.</li>\n</ul>\n","tags":["Depth-First Search","Breadth-First Search","Union-Find","Graph Theory"],"java_snippet":"class Solution {\n    public boolean validTree(int n, int[][] edges) {\n        \n    }\n}","solution":"<h2><a href=\"#solution\"><svg><path></path></svg></a>Solution</h2>\n<hr/>\n<p>For this article, we'll assume that you've already learned the basics of graph theory, and how to perform a simple depth-first search. Most text books on algorithms or discrete math have a section on it.</p>\n<p>There are a <em>lot</em> of different ways to solve this problem, and it's impossible to cover them all. For that reason, I've tried to split the ways into a few general approaches, and then for each I discuss a few additional variants. Some of the ideas that were covered in Approach 1 might apply to Approach 2 as well.</p>\n<br/>\n<hr/>\n<h3><a href=\"#approach-1-graph-theory--iterative-depth-first-search\"><svg><path></path></svg></a>Approach 1: Graph Theory + Iterative Depth-First Search</h3>\n<p><strong>Intuition</strong></p>\n<p><em>Note that this same approach also works with recursive depth-first search and iterative breadth-first search. We'll look at these briefly in the Algorithm section.</em></p>\n<p>Recall that a graph, <code>G</code>, <strong>is a tree iff</strong> the following two conditions are met:</p>\n<ol>\n<li><code>G</code> is fully connected. In other words, for every pair of nodes in <code>G</code>, there is a path between them.</li>\n<li><code>G</code> contains no cycles. In other words, there is exactly <em>one</em> path between each pair of nodes in <code>G</code>.</li>\n</ol>\n<p><strong>Depth-first search</strong> is a classic graph-traversal algorithm that can be used to check for both of these conditions:</p>\n<ol>\n<li><code>G</code> is fully connected if, and only if, we started a depth-first search from a single source and discovered <em>all</em> nodes in <code>G</code> during it.</li>\n<li><code>G</code> contains no cycles if, and only if, the depth-first search never goes back to an already discovered node. We need to be careful though not to count trivial cycles of the form <code>A → B → A</code> that occur with most implementations of undirected edges.</li>\n</ol>\n<p>Depth-first search requires being able to look up the <em>adjacent</em> (immediate neighbours) of a given node. Like many graph interview problems though, the input format we're given doesn't allow us to quickly get the neighbours of a node. Therefore, our first step is to convert the input into an <strong>adjacency list</strong>. Recall that an <strong>adjacency list</strong> is where we have a list of sub-lists, where each sub-list is the list of the immediate neighbours for the i'th node.</p>\n<p>Before we move onto actually carrying out the depth-first search, let's quickly reassure ourselves that an <strong>adjacency list</strong> was the best graph representation for this problem. The other 2 choices would have been an <strong>adjacency matrix</strong> or a <strong>linked representation</strong>.</p>\n<ul>\n<li>An <strong>adjacency matrix</strong> would be an acceptable, although not ideal, representation for this problem. Often, we'd only use an adjacency matrix if we <em>know</em> that the number of edges is substantially higher than the number of nodes. We have no reason to believe that is the case here. Approach 2 will also provide some useful insight into this.</li>\n<li>A <strong>linked representation</strong>, where you make actual nodes objects, would be an overly complicated representation and could suggest to an interviewer that you have a limited understanding of adjacency lists and adjacency matrices. They are not commonly used in interview questions.</li>\n</ul>\n<p>Anyway, let's get started on the <strong>depth-first search</strong>. Recall that most depth-first searches follow a template like the one below for <strong>iterative depth-first search</strong>. Note that this <em>doesn't yet solve the problem of determining whether or not the input graph is a tree</em>—we're simply using it as a step towards building up a solution.</p>\n<p>If you're now really confused, we recommend checking out the <a href=\"https://leetcode.com/explore/learn/card/queue-stack/232/practical-application-stack/\">chapter on DFS in the Stack and Queue Explore Card</a>. The common templates for depth-first search are given and explained in the card.</p>\n<p>Let's now figure out how we can modify the basic depth-first search template to do the two checks we need.</p>\n<p>The first check is straightforward. <strong>If the graph is fully connected</strong>, then every node must have been seen. This means that all nodes must be in the <code>seen</code> set at the end. Because a set removes duplicates, and the only values going into it were valid node numbers, then we know that the graph was fully connected <em>if, and only if,</em> the   <code>seen</code> set contains <code>n</code> values at the end.</p>\n<p>For the second check, you might be thinking: can't we just modify the above algorithm to return <code>false</code> when a neighbour <em>is</em> in visited? i.e.</p>\n<p>This, however, would only work on a <em>directed</em> graph. On an <em>undirected</em> graph, like the one we're working with here, trivial \"cycles\" will be detected. For example, if there's an undirected edge between node <code>A</code> and node <code>B</code>, a detected cycle will include <code>A → B → A</code>. This is because an undirected edge is actually <em>2</em> edges in the adjacency list, and so forms a trivial cycle.</p>\n<p></p>\n<p>There are several strategies of detecting whether or not an <em>undirected</em> graph contains cycles, while excluding the trivial cycles. Most rely on the idea that a depth-first search should only go along each edge <em>once</em>, and therefore only in <em>one</em> direction. This means that when we go along an edge, we should do something to ensure that we don't then later go back along it in the opposite direction. Here are a couple of ways of achieving this.</p>\n<p>The first strategy is to simply delete the opposite direction edges from the adjacency list. In other words, when we follow an edge <code>A → B</code>, we should lookup <code>B</code>s adjacency list and delete <code>A</code> from it, effectively removing the opposite edge of <code>B → A</code>.</p>\n<p>The second strategy is, instead of using a <code>seen</code> set, to use a <code>seen</code> <em>map</em> that also keeps track of the \"parent\" node that we got to a node from. We'll call this map <code>parent</code>. Then, when we iterate through the neighbours of a node, we ignore the \"parent\" node as otherwise it'll be detected as a trivial cycle (and we know that the parent node has already been visited by this point anyway). The starting node (<code>0</code> in this implementation) has no \"parent\", so put it as <code>-1</code>.</p>\n<p>At first, it's a little more difficult to understand why this strategy even works. A good way to think about it is to remember that like the first approach, we just want to avoid going along edges we've already been on (in the opposite direction). The parent links prevent that, as each node is only entered for exploration <em>once</em>. So, imagine you're walking through a maze, with the condition that you're not allowed to go back along <em>any</em> path you've already been on. If you still somehow end up somewhere you were previously, there must have been a cycle!</p>\n<p>The best strategy for this problem is probably the second one, because it doesn't require modifying the adjacency list. For more complex graph problems, the first strategy can be useful though.</p>\n<p><strong>Algorithm</strong></p>\n<p>In the example, we used an <em>iterative depth-first search</em>. Here is the complete code for this.</p>\n<p>Alternatively, you could use recursion, as long as you're fairly confident with it. The recursive approach is more elegant, but is considered <em>inferior</em> to the iterative version in some programming languages, such as Python. This is because the space used by run-time stacks varies between programming languages.</p>\n<p>On the plus side, we can use a simple <code>seen</code> set and just pass a <code>parent</code> parameter. This makes the code a bit simpler!</p>\n<pre><code>class Solution {\n    \n    private List&lt;List&lt;Integer&gt;&gt; adjacencyList = new ArrayList&lt;&gt;();\n    private Set&lt;Integer&gt; seen = new HashSet&lt;&gt;();\n    \n    \n    public boolean validTree(int n, int[][] edges) {\n        \n        if (edges.length != n - 1) return false;\n        \n        for (int i = 0; i &lt; n; i++) {\n            adjacencyList.add(new ArrayList&lt;&gt;());\n        }\n        for (int[] edge : edges) {\n            adjacencyList.get(edge[0]).add(edge[1]);\n            adjacencyList.get(edge[1]).add(edge[0]);\n        }\n        \n        // We return true iff no cycles were detected,\n        // AND the entire graph has been reached.\n        return dfs(0, -1) &amp;&amp; seen.size() == n;   \n    }\n    \n    public boolean dfs(int node, int parent) {\n        if (seen.contains(node)) return false;\n        seen.add(node);\n        for (int neighbour : adjacencyList.get(node)) {\n            if (parent != neighbour) {\n                boolean result = dfs(neighbour, node);\n                if (!result) return false;\n            }\n        }\n        return true;\n    }\n}</code></pre>\n<p>Yet another variant is to use <em>iterative breadth-first search</em>. Recall that <em>breadth-first search</em> and <em>depth-first search</em> are almost the same algorithm, just with a different data structure.</p>\n<p><strong>Complexity Analysis</strong></p>\n<p>Let E be the number of edges, and N be the number of nodes.</p>\n<ul>\n<li>\n<p>Time Complexity : O(N+E).</p>\n<p>Creating the adjacency list requires initialising a list of length N, with a cost of O(N), and then iterating over and inserting E edges, for a cost of O(E). This gives us O(E)+O(N)=O(N+E).</p>\n<p>Each node is added to the data structure <em>once</em>. This means that the outer loop will run N times. For each of the N nodes, its adjacent edges is iterated over once. In total, this means that all E edges are iterated over once by the inner loop. This, therefore, gives a total time complexity of O(N+E).</p>\n<p>Because both parts are the same, we get a final time complexity of O(N+E).</p>\n</li>\n<li>\n<p>Space Complexity : O(N+E).</p>\n<p>The adjacency list is a list of length N, with inner lists with lengths that add to a total of E. This gives a total of O(N+E) space.</p>\n<p>In the worst case, the stack/ queue will have all N nodes on it at the same time, giving a total of O(N) space.</p>\n<p>In total, this gives us O(E+N) space.</p>\n</li>\n</ul>\n<br/>\n<hr/>\n<h3><a href=\"#approach-2-advanced-graph-theory--iterative-depth-first-search\"><svg><path></path></svg></a>Approach 2: Advanced Graph Theory + Iterative Depth-First Search</h3>\n<p><strong>Intuition</strong></p>\n<p>Depending on how much graph theory you know, there's a better definition for determining whether or not a given graph is a tree.</p>\n<p>For the graph to be a valid tree, it must have <em>exactly</em> <code>n - 1</code> edges. Any less, and it can't possibly be fully connected. Any more, and it <em>has</em> to contain cycles. Additionally, if the graph is fully connected <em>and</em> contains exactly <code>n - 1</code> edges, it can't <em>possibly</em> contain a cycle, and therefore must be a tree!</p>\n<p>These facts are fairly straightforward to prove. We won't go into why they are true here, but if you're not familiar with these facts, then we recommend reading up on graph theory. It is <em>very important</em> to be confident with graph theory in-order to pass the interviews at a top tech company.</p>\n<p>Going by this definition, our algorithm needs to do the following:</p>\n<ol>\n<li>Check whether or not there are <code>n - 1</code> edges. If there's not, then return <code>false</code>.</li>\n<li>Check whether or not the graph is <em>fully connected</em>. Return <code>true</code> if it is, <code>false</code> if otherwise.</li>\n</ol>\n<p>Recall that the most complicated part of Approach 1 was in checking whether or not the graph contained cycles. This was because in an undirected graph, we needed to be careful of <em>trivial cycles</em>. Checking whether or not a graph is fully connected is straightforward—we simply checked if all nodes were reachable from a search starting at a single node.</p>\n<p>Like before, we can check for connectivity using recursive depth-first search, iterative depth-first search, or iterative breadth-first search. We still need to use a <code>seen</code> set to prevent the algorithm from getting caught in an infinite loop if there are indeed cycles (and to prevent looping on the trivial cycles).</p>\n<p><strong>Algorithm</strong></p>\n<p>Again, we've provided code for all three variants.</p>\n<p>Iterative Depth-First Search.</p>\n<p>Recursive Depth-First Search.</p>\n<pre><code>class Solution {\n    \n    private List&lt;List&lt;Integer&gt;&gt; adjacencyList = new ArrayList&lt;&gt;();\n    private Set&lt;Integer&gt; seen = new HashSet&lt;&gt;();\n    \n    \n    public boolean validTree(int n, int[][] edges) {\n        \n        if (edges.length != n - 1) return false;\n        \n        // Make the adjacency list.\n        for (int i = 0; i &lt; n; i++) {\n            adjacencyList.add(new ArrayList&lt;&gt;());\n        }\n        for (int[] edge : edges) {\n            adjacencyList.get(edge[0]).add(edge[1]);\n            adjacencyList.get(edge[1]).add(edge[0]);\n        }\n        \n        // Carry out depth first search.\n        dfs(0);\n        // Inspect result and return the verdict.\n        return seen.size() == n;   \n    }\n    \n    public void dfs(int node) {\n        if (seen.contains(node)) return;\n        seen.add(node);\n        for (int neighbour : adjacencyList.get(node)) {\n            dfs(neighbour);\n        }\n    }\n}</code></pre>\n<p>Iterative Breadth-First Search.</p>\n<p><strong>Complexity Analysis</strong></p>\n<p>Let E be the number of edges, and N be the number of nodes.</p>\n<ul>\n<li>\n<p>Time Complexity : O(N).</p>\n<p>When E=N−1, we simply return <code>false</code>. Therefore, the worst case is when E=N−1. Because E is proportional to N, we'll say E=N to simplify the analysis.</p>\n<p>As said above, creating an adjacency list has a time complexity of O(N+E). Because E is now bounded by N, we can reduce this slightly to O(N+N)=O(N).</p>\n<p>The iterative breadth-first search and depth-first search are almost identical. Each node is put onto the queue/stack <em>once</em>, ensured by the <code>seen</code> set. Therefore, the inner \"neighbour\" loop runs once for each node. Across all nodes, the number of cycles this loop does is the same as the number of edges, which is simply N. Therefore, these two algorithms have a time complexity of O(N).</p>\n<p>The recursive depth-first search's \"neighbour\" loop runs only once for each node. Therefore, in total, the function is called once for each edge. So it is called E = N$$$$$E = N times, and N of those times, it actually enters the \"neighbour\" loop. Collectively, the total number of iterations of the \"neighbour\" loop is E=N. So we get O(N), as these all simply add.</p>\n</li>\n<li>\n<p>Space Complexity : O(N).</p>\n<p>Previously, we determined that the adjacency list took O(E+N) space. We now know this is simply O(N).</p>\n<p>In the worst case, the search algorithms will require an additional O(N) space; this is if <em>all</em> nodes were on the stack/queue at the same time.</p>\n<p>So again we get a total of O(N).</p>\n</li>\n</ul>\n<br/>\n<hr/>\n<h3><a href=\"#approach-3--advanced-graph-theory--union-find\"><svg><path></path></svg></a>Approach 3:  Advanced Graph Theory + Union Find</h3>\n<p><strong>Intuition</strong></p>\n<p>In Approach 2, we used this definition for a tree:</p>\n<blockquote>\n<p>For the graph to be a valid tree, it must have <em>exactly</em> <code>n - 1</code> edges. Any less, and it can't possibly be fully connected. Any more, and it <em>has</em> to contain cycles. Additionally, if the graph is fully connected <em>and</em> contains exactly <code>n - 1</code> edges, it can't <em>possibly</em> contain a cycle, and therefore must be a tree!</p>\n</blockquote>\n<p>This definition simplified the problem down to checking whether or not the graph is fully connected. If it is, and if it contains <code>n - 1</code> edges, then we know it's a tree. In the previous approaches, we used graph search algorithms to check whether or not all nodes were reachable, starting from a single source node.</p>\n<p>Another way we could approach the problem is by considering each connected component to be a set of nodes. When an edge is put between two separate connected components, they are merged into a single connected component.  We'll use the example <code>n = 6</code> and <code>edges = [(0, 5), (4, 0), (1, 2), (4, 5), (3, 2)]</code>. Before we look at the edges, we have <code>6</code> sets.</p>\n<p></p>\n<p>We can then go through the list of edges, and merge sets together. For example, because the first edge is <code>(0, 5)</code>, we merge the sets with <code>0</code> and <code>5</code>. This means that we now have five connected components.</p>\n<p></p>\n<p>The next edge is <code>(4, 0)</code>. Therefore, we merge the sets <code>{0, 5}</code> and <code>{4}</code> (remember that because <code>0</code> and <code>5</code> are connected, and <code>4</code> and <code>0</code> are connected, this means that <code>4</code> and <code>5</code> must also be connected).</p>\n<p></p>\n<p>We can continue this same process until we've gone through all the edges. Here is an animation showing this.</p>\n<p></p>\n<p>The conclusion we can draw for this example is that the edges are <em>not</em> in a single connected component, and therefore must contain a cycle. The algorithm should return <code>false</code>.</p>\n<p>And here is another example where the edges <em>do</em> form a single connected component.</p>\n<p></p>\n<p>Did you notice that in the second animation, every edge resulted in a merge operation, but in the first animation, some didn't? This was because of cycles in the graph. Each time there was no merge, it was because we were adding an edge between two nodes that were already connected via a path. This means there is now an additional path between them—which is the definition of a cycle. Therefore, <em>as soon as this happens</em>, we can terminate the algorithm and return <code>false</code>.</p>\n<p>Now, how should we implement this? Well, we could create a list of <code>Set</code>s and then carry out the algorithm as it was done in the animation. There is, however, a better way; a really clever algorithm we call <strong>union find</strong>. I'll give a brief introduction to the algorithm here, however, if you aren't familiar with it, I strongly recommend reading up on it out of a good algorithm textbook. We don't <em>yet</em> have an explore card on union find (at the time of writing this!). Union find is a very useful algorithm that can be used to solve many graph problems.</p>\n<p>Union find represents each of the sets as a directed tree, with the edges pointing <em>towards</em> the root node. For example, consider this graph from our first example above (the one that was <em>not</em> a valid tree).</p>\n<p></p>\n<p>One way its connected components could be represented by union find is as follows:</p>\n<p></p>\n<p>Union find is a <strong>data structure</strong> with 3 methods; <code>makeset(A)</code>, <code>find(A)</code> and <code>union(A, B)</code>.</p>\n<ul>\n<li>\n<p>The <code>makeset(A)</code> method is the simplest. It creates a new size-1 set containing just element <code>A</code>.</p>\n</li>\n<li>\n<p>The <code>find(A)</code> method starts at <code>A</code>, and traces parent links up until it gets to <code>A</code>'s tree root. It then returns the tree root ID. Two nodes that are in the same connected component have the same root. If they're in different connected components, then they will have different roots. For the above example, <code>find(0)</code>, <code>find(4)</code>, and <code>find(5)</code> will all return <code>5</code>. Whereas <code>find(1)</code>, <code>find(2)</code> and <code>find(3)</code> will all return <code>1</code>. This method can be used to check whether or not 2 elements are in the same connected component, and is also used by the <code>union(A, B)</code> method, as we're about to see.</p>\n</li>\n<li>\n<p>The <code>union(A, B)</code> method works by finding the root for <code>A</code> and the root for <code>B</code>, using the <code>find(...)</code> operation. It then sets <code>B</code>s parent to be <code>A</code>, thus combining the two trees into one. For example, if we add the edge <code>(4, 3)</code> to the example above, the algorithm will find that the root of <code>4</code> is <code>5</code>, and the root of <code>3</code> is <code>1</code>, and merge those subtrees. Once this is done, all of the nodes have the same root of <code>5</code>, and therefore we know they all belong to the same connected component.</p>\n</li>\n</ul>\n<p></p>\n<p>We don't need to use linked nodes to represent this structure; we can simply maintain an array of parent pointers. For example, here's how the above tree is represented as an array.</p>\n<p></p>\n<p>Notice how <code>5</code> simply points to itself, as it's the root. The <code>find(...)</code> operation works its way up parent links until it finds a node that points back to itself.</p>\n<p>This algorithm might not seem very efficient, after all, the <code>find(...)</code> operation could be O(n) in the worst case. However, there are two straightforward optimizations we can apply that bring the amortized time close to O(1) for both <code>union(...)</code> and <code>find(...)</code>.</p>\n<ol>\n<li>\n<p>Tracking the sizes of each set; this helps to ensure the tree depth is minimised, as we can ensure the smaller set is attached onto the larger set, and not the other way around. The modifications for this are in the <code>union(...)</code> method.</p>\n</li>\n<li>\n<p>When doing a <code>find(...)</code>, keeping track of all the nodes along the path so that afterwards we can make each point <em>directly</em> at the root, so that next time any of those nodes are searched for, it is O(1). The modifications for this are all in the <code>find(...)</code> method.</p>\n</li>\n</ol>\n<p>Variants of these also exist, that result in the same overall time complexity.</p>\n<p><strong>Algorithm</strong></p>\n<p>Firstly, here's the code <em>without</em> the optimizations. Below, I've also included the code with the optimizations. If you're new to union find, then I recommend reading the code without optimizations first, as it's a lot easier to understand!</p>\n<pre><code>class UnionFind {\n    \n    private int[] parent;\n    \n    // For efficiency, we aren't using makeset, but instead initialising\n    // all the sets at the same time in the constructor.\n    public UnionFind(int n) {\n        parent = new int[n];\n        for (int node = 0; node &lt; n; node++) {\n            parent[node] = node;\n        }\n    }\n    \n    // The find method, without any optimizations. It traces up the parent\n    // links until it finds the root node for A, and returns that root.\n    public int find(int A) {\n        while (parent[A] != A) {\n            A = parent[A];\n        }\n        return A;\n    }\n​\n    // The union method, without any optimizations. It returns True if a\n    // merge happened, False if otherwise.\n    public boolean union(int A, int B) {\n        // Find the roots for A and B.\n        int rootA = find(A);\n        int rootB = find(B);\n        // Check if A and B are already in the same set.\n        if (rootA == rootB) {\n            return false;\n        }\n        // Merge the sets containing A and B.\n        parent[rootA] = rootB;\n        return true;\n    } \n}\n​\nclass Solution {\n    \n    public boolean validTree(int n, int[][] edges) {\n        \n        // Condition 1: The graph must contain n - 1 edges.\n        if (edges.length != n - 1) return false;\n        \n        // Condition 2: The graph must contain a single connected component.\n        // Create a new UnionFind object with n nodes. \n        UnionFind unionFind = new UnionFind(n);\n        // Add each edge. Check if a merge happened, because if it \n        // didn't, there must be a cycle.\n        for (int[] edge : edges) {\n            int A = edge[0];\n            int B = edge[1];\n            if (!unionFind.union(A, B)) {\n                return false;\n            }\n        }\n        \n        // If we got this far, there's no cycles!\n        return true;\n    }\n    \n}</code></pre>\n<p>These are the solutions using the optimizations <em>path compression</em> and <em>union by size</em>.</p>\n<pre><code>class UnionFind {\n    \n    private int[] parent;\n    private int[] size; // We use this to keep track of the size of each set.\n    \n    // For efficiency, we aren't using makeset, but instead initialising\n    // all the sets at the same time in the constructor.\n    public UnionFind(int n) {\n        parent = new int[n];\n        size = new int[n];\n        for (int node = 0; node &lt; n; node++) {\n            parent[node] = node;\n            size[node] = 1;\n        }\n    }\n    \n    // The find method, with path compression. There are ways of implementing\n    // this elegantly with recursion, but the iterative version is easier for\n    // most people to understand!\n    public int find(int A) {\n        // Step 1: Find the root.\n        int root = A;\n        while (parent[root] != root) {\n            root = parent[root];\n        }\n        // Step 2: Do a second traversal, this time setting each node to point\n        // directly at A as we go.\n        while (A != root) {\n            int oldRoot = parent[A];\n            parent[A] = root;\n            A = oldRoot;\n        }\n        return root;\n    }\n​\n    // The union method, with optimization union by size. It returns True if a\n    // merge happened, False if otherwise.\n    public boolean union(int A, int B) {\n        // Find the roots for A and B.\n        int rootA = find(A);\n        int rootB = find(B);\n        // Check if A and B are already in the same set.\n        if (rootA == rootB) {\n            return false;\n        }\n        // We want to ensure the larger set remains the root.\n        if (size[rootA] &lt; size[rootB]) {\n            // Make rootB the overall root.\n            parent[rootA] = rootB;\n            // The size of the set rooted at B is the sum of the 2.\n            size[rootB] += size[rootA];\n        }\n        else {\n            // Make rootA the overall root.\n            parent[rootB] = rootA;\n            // The size of the set rooted at A is the sum of the 2.\n            size[rootA] += size[rootB];\n        }\n        return true;\n    } \n}\n​\nclass Solution {\n    \n    public boolean validTree(int n, int[][] edges) {\n        \n        // Condition 1: The graph must contain n - 1 edges.\n        if (edges.length != n - 1) return false;\n        \n        // Condition 2: The graph must contain a single connected component.\n        // Create a new UnionFind object with n nodes. \n        UnionFind unionFind = new UnionFind(n);\n        // Add each edge. Check if a merge happened, because if it \n        // didn't, there must be a cycle.\n        for (int[] edge : edges) {\n            int A = edge[0];\n            int B = edge[1];\n            if (!unionFind.union(A, B)) {\n                return false;\n            }\n        }\n        \n        // If we got this far, there's no cycles!\n        return true;\n    }\n    \n}</code></pre>\n<p><strong>Complexity Analysis</strong></p>\n<p>Let E be the number of edges, and N be the number of nodes.</p>\n<p>α(N) is the <a href=\"https://en.wikipedia.org/wiki/Ackermann_function#Inverse\">Inverse Ackermann Function</a>.</p>\n<ul>\n<li>\n<p>Time Complexity : O(N⋅α(N)).</p>\n<p>When E=N−1, we simply return <code>false</code>. Therefore, the worst case is when E=N−1. Because E is proportional to N, we'll say E=N to simplify the analysis.</p>\n<p>We are putting each of the N edges into the <code>UnionFind</code> data structure, using the <code>union(...)</code> method. The <code>union(...)</code> method itself has no loops or recursion, so the entire cost of calling it is dependent on the cost of the <code>find(...)</code> method that it calls.</p>\n<p><code>find(...)</code>'s cost is dependent on how far the node it was searching for is from the root. Using the naïve implementation of union find, this depth could be N. If this was the case for all of the calls, we'd have a final cost of O(N2).</p>\n<p>However, remember those optimizations we did? Those keep the tree depths very shallow. It turns out that <code>find(...)</code> <em>amortizes</em> to O(α(N)), where α is the <a href=\"https://en.wikipedia.org/wiki/Ackermann_function#Inverse\">Inverse Ackermann Function</a>. The incredible thing about this function is that it grows <em>so slowly</em> that N will <em>never</em> go higher than 4 in the universe as we know it! So while in \"practice\" it is effectively O(1), in \"theory\" it is not.</p>\n<p>Actually <em>proving</em> this upper bound on the depth is a very advanced proof, which I'd certainly <em>hope</em> you'd never need to do in an interview! If you're interested though, I recommend looking in a good algorithm's text book or paper.</p>\n<p>Anyway, this gives us a total of N⋅O(α(N))=O(N⋅α(N)).</p>\n</li>\n<li>\n<p>Space Complexity : O(N).</p>\n<p>The UnionFind data structure requires O(N) space to store the arrays it uses.</p>\n</li>\n</ul>\n<p><em>So, why is this better than Approach 2?</em></p>\n<p>Complexity analysis ignores constants. For example, O(10⋅N)=O(N). Even O(10000⋅N)=O(N). Sometimes the constants we're ignoring in the analysis are still having a big impact on the run-time in practice.</p>\n<p>Approach 2 had a lot of overhead in needing to create an adjacency list with the edges before it could even begin the depth-first search. This is all treated as a constant, as it ultimately had the same time complexity as the depth-first search itself.</p>\n<p>Approach 3 doesn't need to change the input format, it can just get straight to determining whether or not there is a cycle. Additionally the bit that stops it being constant, the α(N), will <em>never</em> have a value larger than 4. So in practice, it behaves as a constant too—and a far smaller one at that!</p>\n<p>When weighing up the pros and cons of different algorithms for solving problems, it's best to treat union find's operations as O(1) to get a fair and accurate comparison.</p>\n<br/>"}