{"id":"279","title":"Perfect Squares","difficulty":"Medium","content":"<p>Given an integer <code>n</code>, return <em>the least number of perfect square numbers that sum to</em> <code>n</code>.</p>\n\n<p>A <strong>perfect square</strong> is an integer that is the square of an integer; in other words, it is the product of some integer with itself. For example, <code>1</code>, <code>4</code>, <code>9</code>, and <code>16</code> are perfect squares while <code>3</code> and <code>11</code> are not.</p>\n\n<p>&nbsp;</p>\n<p><strong class=\"example\">Example 1:</strong></p>\n\n<pre>\n<strong>Input:</strong> n = 12\n<strong>Output:</strong> 3\n<strong>Explanation:</strong> 12 = 4 + 4 + 4.\n</pre>\n\n<p><strong class=\"example\">Example 2:</strong></p>\n\n<pre>\n<strong>Input:</strong> n = 13\n<strong>Output:</strong> 2\n<strong>Explanation:</strong> 13 = 4 + 9.\n</pre>\n\n<p>&nbsp;</p>\n<p><strong>Constraints:</strong></p>\n\n<ul>\n\t<li><code>1 &lt;= n &lt;= 10<sup>4</sup></code></li>\n</ul>\n","tags":["Math","Dynamic Programming","Breadth-First Search"],"java_snippet":"class Solution {\n    public int numSquares(int n) {\n        \n    }\n}","solution":"<h2><a href=\"#solution\"><svg><path></path></svg></a>Solution</h2>\n<hr/>\n<h3><a href=\"#approach-1-brute-force-enumeration-time-limit-exceeded\"><svg><path></path></svg></a>Approach 1: Brute-force Enumeration [Time Limit Exceeded]</h3>\n<p><strong>Intuition</strong></p>\n<p>The problem asks us to find the <strong>least</strong> numbers of square numbers that can sum up to a given number. We could rephrase the problem as follows:</p>\n<blockquote>\n<p>Given a list of square numbers and a positive integer number <code>n</code>, one is asked to find a combination of square numbers that sum up to <code>n</code>, and the combination should contain the <strong><em>least</em></strong> numbers among all possible solutions.<br/><br/>\n<em>Note:</em> one could reuse the square numbers in the combination.</p>\n</blockquote>\n<p>From the above narrative of the problem, it seems to be a <em>combination</em> problem, to which an intuitive solution would be the <code>brute-force enumeration</code> where we enumerate all possible combinations and find the minimal one of them.</p>\n<p>We could formulate the problem in the following formula:</p>\n<p>numSquares(n)=min(numSquares(n-k) + 1)∀k∈{square numbers}</p>\n<p>From the above formula, one can translate it into a <strong><em>recursive</em></strong> solution literally. Here is one example.</p>\n<p>The above solution could work for small numbers. However, as one would find out, we would quickly run into the <code>Time Limit Exceeded</code> exception even for medium-size numbers (<em>e.g.</em> 55).</p>\n<p>Or simply we might encounter the <code>Stack Overflow</code> due the to the excessive recursion.<br/>\n<br/><br/>\n<br/></p>\n<hr/>\n<h3><a href=\"#approach-2-dynamic-programming\"><svg><path></path></svg></a>Approach 2: Dynamic Programming</h3>\n<p><strong>Intuition</strong></p>\n<p>The reason why it failed with the brute-force approach is simply because we re-calculate the sub-solutions over and over again. However, the formula that we derived before is still valuable. All we need is a better way to implement the formula.</p>\n<p>numSquares(n)=min(numSquares(n-k) + 1)∀k∈{square numbers}</p>\n<p>One might notice that, the problem is similar to the <a href=\"https://leetcode.com/problems/fibonacci-number/\">Fibonacci number problem</a>, judging from the formula. And like Fibonacci number, we have several more efficient ways to calculate the solution, other than the simple recursion.</p>\n<p>One of the ideas to solve the stack overflow issue in recursion is to apply the <strong><em>Dynamic Programming</em></strong> (DP) technique, which is built upon the idea of reusing the results of intermediate sub-solutions to calculate the final solution.</p>\n<p>To calculate the value of numSquares(n), first we need to calculate all the values before n, <em>i.e.</em> numSquares(n−k)∀k∈{square numbers}. If we have already kept the solution for the number n−k in somewhere, we then would not need to resort to the recursive calculation which prevents the stack overflow.</p>\n<p><strong>Algorithm</strong></p>\n<p>Based on the above intuition, we could implement the DP solution in the following steps.</p>\n<ul>\n<li>As for almost all DP solutions, we first create an array <code>dp</code> of one or multiple dimensions to hold the values of intermediate sub-solutions, as well as the final solution which is usually the last element in the array. <em>Note that</em>, we create a fictional element <code>dp[0]=0</code> to simplify the logic, which helps in the case that the remainder (<code>n-k</code>) happens to be a square number.\n<br/>\n</li>\n<li>As an additional preparation step, we pre-calculate a list of square numbers (<em>i.e.</em> <code>square_nums</code>) that is less than the given number <code>n</code>.\n<br/>\n</li>\n<li>As the main step, we then loop from the number <code>1</code> to <code>n</code>, to calculate the solution for each number <code>i</code> (<em>i.e.</em> <code>numSquares(i)</code>). At each iteration, we keep the result of <code>numSquares(i)</code> in <code>dp[i]</code>, while resuing the previous results stored in the array.\n<br/>\n</li>\n<li>At the end of the loop, we then return the last element in the array as the result of the solution.</li>\n</ul>\n<p>In the graph below, we illustrate how to calculate the results of <code>numSquares(4)</code> and <code>numSquares(5)</code> which correspond to the values in <code>dp[4]</code> and <code>dp[5]</code>.</p>\n<p></p>\n<p>Here are some sample implementations. In particular, the Python solution took ~3500 ms, which was faster than ~50% submissions at the time.</p>\n<p><strong>Note:</strong> the following python solution works for Python2 only. For some unknown reason, it takes significantly longer time for Python3 to run the same code.</p>\n<pre><code>class Solution {\n​\n  public int numSquares(int n) {\n    int dp[] = new int[n + 1];\n    Arrays.fill(dp, Integer.MAX_VALUE);\n    // bottom case\n    dp[0] = 0;\n​\n    // pre-calculate the square numbers.\n    int max_square_index = (int) Math.sqrt(n) + 1;\n    int square_nums[] = new int[max_square_index];\n    for (int i = 1; i &lt; max_square_index; ++i) {\n      square_nums[i] = i * i;\n    }\n​\n    for (int i = 1; i &lt;= n; ++i) {\n      for (int s = 1; s &lt; max_square_index; ++s) {\n        if (i &lt; square_nums[s])\n          break;\n        dp[i] = Math.min(dp[i], dp[i - square_nums[s]] + 1);\n      }\n    }\n    return dp[n];\n  }\n}</code></pre>\n<p><strong>Complexity</strong></p>\n<ul>\n<li>\n<p>Time complexity:  O(n⋅n<svg><path></path></svg>​). In main step, we have a nested loop, where the outer loop is of n iterations and in the inner loop it takes at maximum n<svg><path></path></svg>​ iterations.</p>\n</li>\n<li>\n<p>Space Complexity: O(n). We keep all the intermediate sub-solutions in the array <code>dp[]</code>.</p>\n<br/>\n</li>\n</ul>\n<br/>\n<hr/>\n<h3><a href=\"#approach-3-greedy-enumeration\"><svg><path></path></svg></a>Approach 3: Greedy Enumeration</h3>\n<p><strong>Intuition</strong></p>\n<p>Recursion isn't bad though. Above all, it provides us a concise and intuitive way to understand the problem. We could still resolve the problem with recursion. To improve the above brute-force enumeration solution, we could add a touch of <code>Greedy</code> into the recursion process. We could reformulate the enumeration solution as follows:</p>\n<blockquote>\n<p>Starting from the combination of one single number to multiple numbers, <em>once</em> we find a combination that can sum up to the given number <code>n</code>, then we can say that we must have found the <code>smallest</code> combination, since we enumerate the combinations <em>greedily</em> from small to large.</p>\n</blockquote>\n<p>To better explain the above intuition, let us first define a function called <code>is_divided_by(n, count)</code> which returns a boolean value to indicate whether the number <code>n</code> can be divided by a combination with <code>count</code> number of square numbers, rather than returning the exact size of combination as the previous function <code>numSquares(n)</code>.</p>\n<p>numSquares(n)=argmincount∈[1,2,...n]​(is_divided_by(n,count))</p>\n<p>In addition, the function <code>is_divided_by(n, count)</code> could also assume the form of recursion as follows:<br/>\nis_divided_by(n,count)=is_divided_by(n−k,count−1)∃k∈{square numbers}</p>\n<blockquote>\n<p>Different from the recursive function of <code>numSquare(n)</code>, the recursion process of <code>is_divided_by(n, count)</code> would boil down to its bottom case (<em>i.e.</em> <code>count==1</code>) much more <em>rapid</em>.</p>\n</blockquote>\n<p>Here is one example on how the function <code>is_divided_by(n, count)</code> breaks down for the input <code>n=5</code> and <code>count=2</code>.</p>\n<br/>\n<p></p>\n<p>With this trick of reformulation, we could dramatically reduce the risk of stack overflow.</p>\n<p><strong>Algorithm</strong></p>\n<ul>\n<li>First of all, we prepare a list of square numbers (named <code>square_nums</code>) that are less than the given number <code>n</code>.\n<br/>\n</li>\n<li>In the main loop, iterating the size of combination (named <code>count</code>) from one to <code>n</code>, we check if the number <code>n</code> can be divided by the sum of the combination, <em>i.e.</em> <code>is_divided_by(n, count)</code>.\n<br/>\n</li>\n<li>The function <code>is_divided_by(n, count)</code> can be implemented in the form of recursion as we defined in the intuition section.\n<br/>\n</li>\n<li>In the bottom case, we have <code>count==1</code>, we just need to check if the number <code>n</code> is a square number itself. We could use the inclusion test with the list <code>square_nums</code> that we prepared before, <em>i.e.</em> n∈square_nums. And if we use the <code>set</code> data structure for <code>square_nums</code>, we could obtain a faster running time than the approach of <code>n == int(sqrt(n)) ^ 2</code>.</li>\n</ul>\n<p>Concerning the correctness of the algorithm, often the case we could prove the Greedy algorithm by <strong>contradiction</strong>. This is no exception. Suppose we find a <code>count=m</code> that can divide the number <code>n</code>, and suppose in the later iterations there exists another number <code>count=p</code> that can also divide the number and the combination is smaller than the found one <em>i.e.</em> <code>p &lt; m</code>. Given the order of the iteration, the <code>count=p</code> would have been discovered before <code>count=m</code> which is contradict to the fact that <code>p</code> comes later than <code>m</code>. Therefore, we can say that the algorithm works as expected, which always finds the minimal size of combination.</p>\n<p>Here are some sample implementation. In particular, the Python solution took ~<em>70ms</em>, which was faster than ~ <em>90%</em> submissions at the time.</p>\n<pre><code>class Solution {\n  Set&lt;Integer&gt; square_nums = new HashSet&lt;Integer&gt;();\n​\n  protected boolean is_divided_by(int n, int count) {\n    if (count == 1) {\n      return square_nums.contains(n);\n    }\n​\n    for (Integer square : square_nums) {\n      if (is_divided_by(n - square, count - 1)) {\n        return true;\n      }\n    }\n    return false;\n  }\n​\n  public int numSquares(int n) {\n    this.square_nums.clear();\n​\n    for (int i = 1; i * i &lt;= n; ++i) {\n      this.square_nums.add(i * i);\n    }\n​\n    int count = 1;\n    for (; count &lt;= n; ++count) {\n      if (is_divided_by(n, count))\n        return count;\n    }\n    return count;\n  }\n}</code></pre>\n<p><strong>Complexity</strong></p>\n<ul>\n<li>\n<p>Time complexity:  O(n<svg><path></path></svg>​−1n<svg><path></path></svg>​h+1−1​)=O(n2h​) where <code>h</code> is the maximal number of recursion that could happen. As one might notice, the above formula actually resembles the formula to calculate the number of nodes in a complete N-ary tree. Indeed, the trace of recursive calls in the algorithm form a N-ary tree, where N is the number of squares in <code>square_nums</code>, <em>i.e.</em> n<svg><path></path></svg>​. In the worst case, we might have to traverse the entire tree to find the solution.</p>\n<br/>\n</li>\n<li>\n<p>Space Complexity: O(n<svg><path></path></svg>​). We keep a list of <code>square_nums</code>, which is of n<svg><path></path></svg>​ size. In addition, we would need additional space for the recursive call stack. But as we will learn later, the size of the call track would not exceed 4.</p>\n<br/>\n</li>\n</ul>\n<br/>\n<hr/>\n<h3><a href=\"#approach-4-greedy--bfs-breadth-first-search\"><svg><path></path></svg></a>Approach 4: Greedy + BFS (Breadth-First Search)</h3>\n<p><strong>Intuition</strong></p>\n<p>As we mentioned in the complexity analysis in the above Greedy approach, the trace of the call stack forms a N-ary tree where each node represents a call to the <code>is_divided_by(n, count)</code> function. Based on the above intuition, again we could reformulate the original problem as follows:</p>\n<blockquote>\n<p>Given a N-ary tree, where each node represents a <strong>remainder</strong> of the number <code>n</code> subtracting a combination of square numbers, our task is to find a node in the tree, which should meet two conditions:<br/>\n1). the value of the node (<em>i.e.</em> the remainder) should be a square number as well.<br/>\n2). the distance between the node and the root should be minimal among all nodes that meet the condition (1).</p>\n</blockquote>\n<p>Here is an example how the tree would look like.</p>\n<p></p>\n<p>In the previous Approach #3, due to the <em>Greedy</em> strategy that we perform the calls, we were actually constructing the N-ary tree level-by-level from top to down. And the we were traversing it in a <strong><em>BFS</em></strong> (Breadth-First Search) manner. At each level of the N-ary tree, we were enumerating the combinations that are of the same size.</p>\n<p>The order of traversing is of BFS, rather than DFS (Depth-First Search), is due to the fact that before exhausting all the possibilities of decomposing a number <code>n</code> with a fixed amount of squares, we would not explore any potential combination that needs more elements.</p>\n<p><strong>Algorithm</strong></p>\n<ul>\n<li>Again, first of all, we prepare a list of square numbers (named <code>square_nums</code>) that are less than the given number <code>n</code>.\n<br/>\n</li>\n<li>We then create a <code>queue</code> variable which would keep all the remainders to enumerate at each level.\n<br/>\n</li>\n<li>In the main loop, we iterate over the <code>queue</code> variable. At each iteration, we check if the remainder is one of the square numbers. If the remainder is not a square number, we subtract it with one of the square numbers to obtain a new remainder and then add the new remainder to the <code>next_queue</code> for the iteration of the next level. We break out of the loop once we encounter a remainder that is of a square number, which also means that we find the solution.</li>\n</ul>\n<p><strong><em>Note</em></strong>: in a typical BFS algorithm, the <code>queue</code> variable usually would be of array or list type. However, here we use the set type, in order to eliminate the redundancy of remainders within the same level. As it turns out, this tiny trick could even provide a 5 times speedup on running time.</p>\n<p>In the following graph, we illustrate the layout of the queue, on the example of <code>numSquares(7)</code>.</p>\n<p></p>\n<p>Here are some sample implementations. In particular, the Python implementation inspired from the post of <a href=\"https://leetcode.com/problems/perfect-squares/discuss/71475/Short-Python-solution-using-BFS\">ChrisZhang12240</a> took ~200 ms which was faster than ~72% of submission at that time.</p>\n<pre><code>class Solution {\n  public int numSquares(int n) {\n​\n    ArrayList&lt;Integer&gt; square_nums = new ArrayList&lt;Integer&gt;();\n    for (int i = 1; i * i &lt;= n; ++i) {\n      square_nums.add(i * i);\n    }\n​\n    Set&lt;Integer&gt; queue = new HashSet&lt;Integer&gt;();\n    queue.add(n);\n​\n    int level = 0;\n    while (queue.size() &gt; 0) {\n      level += 1;\n      Set&lt;Integer&gt; next_queue = new HashSet&lt;Integer&gt;();\n​\n      for (Integer remainder : queue) {\n        for (Integer square : square_nums) {\n          if (remainder.equals(square)) {\n            return level;\n          } else if (remainder &lt; square) {\n            break;\n          } else {\n            next_queue.add(remainder - square);\n          }\n        }\n      }\n      queue = next_queue;\n    }\n    return level;\n  }\n}</code></pre>\n<p><strong>Complexity</strong></p>\n<ul>\n<li>\n<p>Time complexity: O(n<svg><path></path></svg>​−1n<svg><path></path></svg>​h+1−1​)=O(n2h​) where <code>h</code> is the height of the N-ary tree. One can see the detailed explanation on the previous Approach #3.</p>\n<br/>\n</li>\n<li>\n<p>Space complexity: O((n<svg><path></path></svg>​)h), which is also the maximal number of nodes that can appear at the level <code>h</code>. As one can see, though we keep a list of <code>square_nums</code>, the main consumption of the space is the <code>queue</code> variable, which keep track of the remainders to visit for a given level of N-ary tree.</p>\n<br/>\n</li>\n</ul>\n<br/>\n<hr/>\n<h3><a href=\"#approach-5-mathematics\"><svg><path></path></svg></a>Approach 5: Mathematics</h3>\n<p><strong>Intuition</strong></p>\n<p>The problem can be solved with the mathematical theorems that have been proposed and proved over time. We will break down the problem into several cases in this section.</p>\n<p>In 1770, <a href=\"https://en.wikipedia.org/wiki/Lagrange%27s_four-square_theorem\">Joseph Louis Lagrange</a> proved a theorem, called <em>Lagrange's four-square theorem</em>, also known as Bachet's conjecture, which states that every natural number can be represented as the sum of four integer squares:<br/>\np=a02​+a12​+a22​+a32​<br/>\nwhere the four numbers<br/>\na0​,a1​,a2​,a3​ are integers.</p>\n<p>For example, 3, 31 can be represented as the sum of four squares as follows:<br/>\n3=12+12+12+0231=52+22+12+12</p>\n<blockquote>\n<p>Case 1). The Lagrange's four-square theorem sets the upper bound for the results of the problem, <em>i.e.</em> if the number <code>n</code> cannot be decomposed into a fewer number of squares, <em>at least</em> it can be decomposed into the sum of <strong>4</strong> square numbers, <em>i.e.</em> numSquares(n)≤4.</p>\n</blockquote>\n<p>As one might notice in the above example, the number zero is also considered as a square number, so we can consider that the number 3 can either be decomposed into 3 or 4 square numbers.</p>\n<p><em>However, Lagrange's four-square theorem does not tell us directly the <em>least</em> numbers of square to decompose a natural number.</em></p>\n<p>Later, in 1797, <a href=\"https://en.wikipedia.org/wiki/Adrien-Marie_Legendre\">Adrien-Marie Legendre</a> completed the four-square theorem with his <strong><em>three-square theorem</em></strong>, by proving a particular condition that a positive integer can be expressed as the sum of three squares:<br/>\nn=4k(8m+7)⟺n=a02​+a12​+a22​<br/>\nwhere k and m are integers.</p>\n<blockquote>\n<p>Case 2). Unlike the four-square theorem, Adrien-Marie Legendre's three-square theorem gives us a <strong>necessary</strong> and <strong>sufficient</strong> condition to check if the number can <strong>ONLY</strong> be decomposed into 4 squares, not fewer.</p>\n</blockquote>\n<p>It might be tricky to see the conclusion that we made in the case (2) from the three-square theorem. Let us elaborate the deduction procedure a bit.<br/>\nFirst of all, the three-square theorem tells us that if the number <code>n</code> is of the form n=4k(8m+7), then the number <code>n</code> cannot be decomposed into the sum of 3 numbers of squares. Further, we can also <strong>assert</strong> that the number <code>n</code> cannot be decomposed into the sum of two squares, neither the number itself is a square. Because suppose the number <code>n</code> can be decomposed as n=a02​+a12​, then by adding the square number zero into the expression, <em>i.e.</em> n=a02​+a12​+02, we obtain the conclusion that the number <code>n</code> can be decomposed into 3 squares, which is <strong>contradicted</strong> to the three-square theorem. Therefore, together with the four-square theorem, we can assert that if the number does not meet the condition of the three-square theorem, it can ONLY be decomposed into the sum of 4 squares, not fewer.<br/>\n<br/></p>\n<p>If the number meets the condition of the three-square theorem, we know that if can be decomposed into 3 squares. But what we don't know is that whether the number can be decomposed into fewer squares, <em>i.e.</em> one or two squares.<br/>\nSo before we attribute the number to the bottom case (three-square theorem), here are the two cases remained to check, namely:</p>\n<blockquote>\n<p>Case 3.1). if the number is a square number itself, which is easy to check <em>e.g.</em> <code>n == int(sqrt(n)) ^ 2</code>.</p>\n</blockquote>\n<blockquote>\n<p>Case 3.2). if the number can be decomposed into the sum of two squares. Unfortunately, there is no mathematical weapon that can help us to check this case in one shot. We need to resort to the <strong>enumeration</strong> approach.</p>\n</blockquote>\n<p><strong>Algorithm</strong></p>\n<p>One can literally follow the above cases to implement the solution.</p>\n<ul>\n<li>First, we check if the number <code>n</code> is of the form n=4k(8m+7), if so we return 4 directly.\n<br/>\n</li>\n<li>Otherwise, we further check if the number is of a square number itself or the number can be decomposed the sum of two squares.\n<br/>\n</li>\n<li>In the bottom case, the number can be decomposed into the sum of 3 squares, though we can also consider it decomposable by 4 squares by adding zero according to the four-square theorem. But we are asked to find the least number of squares.</li>\n</ul>\n<p>We give some sample implementations here. The solution is inspired from the posts of <a href=\"https://leetcode.com/problems/perfect-squares/discuss/376795/100-O(log-n)-Python3-Solution-Lagrange's-four-square-theorem\">TCarmic</a> and <a href=\"https://tinyurl.com/y4falx4f\">StefanPochmann</a> in the <a href=\"https://leetcode.com/problems/perfect-squares/discuss/\">Discussion</a> forum.</p>\n<pre><code>class Solution {\n​\n  protected boolean isSquare(int n) {\n    int sq = (int) Math.sqrt(n);\n    return n == sq * sq;\n  }\n​\n  public int numSquares(int n) {\n    // four-square and three-square theorems.\n    while (n % 4 == 0)\n      n /= 4;\n    if (n % 8 == 7)\n      return 4;\n​\n    if (this.isSquare(n))\n      return 1;\n    // enumeration to check if the number can be decomposed into sum of two squares.\n    for (int i = 1; i * i &lt;= n; ++i) {\n      if (this.isSquare(n - i * i))\n        return 2;\n    }\n    // bottom case of three-square theorem.\n    return 3;\n  }\n}</code></pre>\n<p><strong>Complexity</strong></p>\n<ul>\n<li>\n<p>Time complexity: O(n<svg><path></path></svg>​). In the main loop, we check if the number can be decomposed into the sum of two squares, which takes O(n<svg><path></path></svg>​) iterations. In the rest of cases, we do the check in constant time.</p>\n<br/>\n</li>\n<li>\n<p>Space complexity: O(1). The algorithm consumes a constant space, regardless the size of the input number.</p>\n<br/>\n</li>\n</ul>\n<br/>"}